<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Learning-SQL" data-toc-modified-id="Learning-SQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Learning SQL</a></span><ul class="toc-item"><li><span><a href="#RDBMS" data-toc-modified-id="RDBMS-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>RDBMS</a></span></li><li><span><a href="#Database-:" data-toc-modified-id="Database-:-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Database :</a></span></li><li><span><a href="#Table" data-toc-modified-id="Table-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Table</a></span></li><li><span><a href="#Table-Names" data-toc-modified-id="Table-Names-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Table Names</a></span></li><li><span><a href="#Schema" data-toc-modified-id="Schema-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Schema</a></span></li><li><span><a href="#Column" data-toc-modified-id="Column-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Column</a></span></li><li><span><a href="#Breaking-Up-Data" data-toc-modified-id="Breaking-Up-Data-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Breaking Up Data</a></span></li><li><span><a href="#Datatype" data-toc-modified-id="Datatype-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Datatype</a></span></li><li><span><a href="#Datatype-Compatibility" data-toc-modified-id="Datatype-Compatibility-1.9"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>Datatype Compatibility</a></span></li><li><span><a href="#Row" data-toc-modified-id="Row-1.10"><span class="toc-item-num">1.10&nbsp;&nbsp;</span>Row</a></span></li><li><span><a href="#Primary-key" data-toc-modified-id="Primary-key-1.11"><span class="toc-item-num">1.11&nbsp;&nbsp;</span>Primary key</a></span></li><li><span><a href="#Always-Define-Primary-Keys" data-toc-modified-id="Always-Define-Primary-Keys-1.12"><span class="toc-item-num">1.12&nbsp;&nbsp;</span>Always Define Primary Keys</a></span></li><li><span><a href="#What-Is-SQL?" data-toc-modified-id="What-Is-SQL?-1.13"><span class="toc-item-num">1.13&nbsp;&nbsp;</span>What Is SQL?</a></span></li><li><span><a href="#SQL-Extensions" data-toc-modified-id="SQL-Extensions-1.14"><span class="toc-item-num">1.14&nbsp;&nbsp;</span>SQL Extensions</a></span></li></ul></li><li><span><a href="#SQL-Statement-Syntax" data-toc-modified-id="SQL-Statement-Syntax-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SQL Statement Syntax</a></span></li><li><span><a href="#Retrieving-Data" data-toc-modified-id="Retrieving-Data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Retrieving Data</a></span><ul class="toc-item"><li><span><a href="#Presentation-of-Data" data-toc-modified-id="Presentation-of-Data-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Presentation of Data</a></span></li><li><span><a href="#wildcard-(*):" data-toc-modified-id="wildcard-(*):-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>wildcard (*):</a></span></li><li><span><a href="#Distinct-row" data-toc-modified-id="Distinct-row-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Distinct row</a></span><ul class="toc-item"><li><span><a href="#Caution:-Can’t-Be-Partially-DISTINCT" data-toc-modified-id="Caution:-Can’t-Be-Partially-DISTINCT-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>Caution: Can’t Be Partially DISTINCT</a></span></li></ul></li><li><span><a href="#Limiting-Results" data-toc-modified-id="Limiting-Results-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Limiting Results</a></span></li><li><span><a href="#OFFSET-5" data-toc-modified-id="OFFSET-5-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>OFFSET 5</a></span><ul class="toc-item"><li><span><a href="#Caution:-Row-0" data-toc-modified-id="Caution:-Row-0-3.5.1"><span class="toc-item-num">3.5.1&nbsp;&nbsp;</span>Caution: Row 0</a></span></li></ul></li><li><span><a href="#Challenges" data-toc-modified-id="Challenges-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Challenges</a></span></li></ul></li><li><span><a href="#Sorting-Retrieved-Data" data-toc-modified-id="Sorting-Retrieved-Data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Sorting Retrieved Data</a></span><ul class="toc-item"><li><span><a href="#Clause" data-toc-modified-id="Clause-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Clause</a></span><ul class="toc-item"><li><span><a href="#Caution:-Position-of-ORDER-BY-Clause" data-toc-modified-id="Caution:-Position-of-ORDER-BY-Clause-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Caution: Position of ORDER BY Clause</a></span></li></ul></li><li><span><a href="#Specifying-Sort-Direction" data-toc-modified-id="Specifying-Sort-Direction-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Specifying Sort Direction</a></span></li><li><span><a href="#Sorting-by-Multiple-Columns" data-toc-modified-id="Sorting-by-Multiple-Columns-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Sorting by Multiple Columns</a></span></li><li><span><a href="#Sorting-by-Column-Position" data-toc-modified-id="Sorting-by-Column-Position-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Sorting by Column Position</a></span><ul class="toc-item"><li><span><a href="#Case-Sensitivity-and-Sort-Orders" data-toc-modified-id="Case-Sensitivity-and-Sort-Orders-4.4.1"><span class="toc-item-num">4.4.1&nbsp;&nbsp;</span>Case Sensitivity and Sort Orders</a></span></li><li><span><a href="#Write-a-SQL-statement" data-toc-modified-id="Write-a-SQL-statement-4.4.2"><span class="toc-item-num">4.4.2&nbsp;&nbsp;</span>Write a SQL statement</a></span></li></ul></li></ul></li><li><span><a href="#Filtering-Data" data-toc-modified-id="Filtering-Data-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Filtering Data</a></span><ul class="toc-item"><li><span><a href="#Using-the-WHERE-Clause" data-toc-modified-id="Using-the-WHERE-Clause-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Using the WHERE Clause</a></span><ul class="toc-item"><li><span><a href="#Caution:-WHERE-Clause-Position" data-toc-modified-id="Caution:-WHERE-Clause-Position-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>Caution: WHERE Clause Position</a></span></li><li><span><a href="#When-to-Use-Quotes" data-toc-modified-id="When-to-Use-Quotes-5.1.2"><span class="toc-item-num">5.1.2&nbsp;&nbsp;</span>When to Use Quotes</a></span></li><li><span><a href="#!=-or-<>?" data-toc-modified-id="!=-or-<>?-5.1.3"><span class="toc-item-num">5.1.3&nbsp;&nbsp;</span>!= or &lt;&gt;?</a></span></li></ul></li><li><span><a href="#Checking-for-a-Range-of-Values" data-toc-modified-id="Checking-for-a-Range-of-Values-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Checking for a Range of Values</a></span></li><li><span><a href="#Checking-for-No-Value" data-toc-modified-id="Checking-for-No-Value-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Checking for No Value</a></span><ul class="toc-item"><li><span><a href="#Caution:-NULL-and-Nonmatches" data-toc-modified-id="Caution:-NULL-and-Nonmatches-5.3.1"><span class="toc-item-num">5.3.1&nbsp;&nbsp;</span>Caution: NULL and Nonmatches</a></span></li></ul></li></ul></li><li><span><a href="#Advanced-Data-Filtering" data-toc-modified-id="Advanced-Data-Filtering-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Advanced Data Filtering</a></span><ul class="toc-item"><li><span><a href="#Operator" data-toc-modified-id="Operator-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Operator</a></span></li><li><span><a href="#AND" data-toc-modified-id="AND-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>AND</a></span><ul class="toc-item"><li><span><a href="#Note:-No-ORDER-BY-Clause-Specified" data-toc-modified-id="Note:-No-ORDER-BY-Clause-Specified-6.2.1"><span class="toc-item-num">6.2.1&nbsp;&nbsp;</span>Note: No ORDER BY Clause Specified</a></span></li></ul></li><li><span><a href="#OR" data-toc-modified-id="OR-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>OR</a></span><ul class="toc-item"><li><span><a href="#Tip:-Using-Parentheses-in-WHERE-Clauses" data-toc-modified-id="Tip:-Using-Parentheses-in-WHERE-Clauses-6.3.1"><span class="toc-item-num">6.3.1&nbsp;&nbsp;</span>Tip: Using Parentheses in WHERE Clauses</a></span></li></ul></li><li><span><a href="#IN" data-toc-modified-id="IN-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>IN</a></span></li><li><span><a href="#NOT" data-toc-modified-id="NOT-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>NOT</a></span></li></ul></li><li><span><a href="#Using-Wildcard-Filtering" data-toc-modified-id="Using-Wildcard-Filtering-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Using Wildcard Filtering</a></span><ul class="toc-item"><li><span><a href="#Wildcards" data-toc-modified-id="Wildcards-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Wildcards</a></span></li><li><span><a href="#Search-pattern" data-toc-modified-id="Search-pattern-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Search pattern</a></span></li><li><span><a href="#Predicate" data-toc-modified-id="Predicate-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Predicate</a></span></li><li><span><a href="#The-Percent-Sign-(%)-Wildcard" data-toc-modified-id="The-Percent-Sign-(%)-Wildcard-7.4"><span class="toc-item-num">7.4&nbsp;&nbsp;</span>The Percent Sign (%) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Case-Sensitivity" data-toc-modified-id="Note:-Case-Sensitivity-7.4.1"><span class="toc-item-num">7.4.1&nbsp;&nbsp;</span>Note: Case Sensitivity</a></span></li><li><span><a href="#Tip:-Searching-for-Partial-Email-Addresses" data-toc-modified-id="Tip:-Searching-for-Partial-Email-Addresses-7.4.2"><span class="toc-item-num">7.4.2&nbsp;&nbsp;</span>Tip: Searching for Partial Email Addresses</a></span></li><li><span><a href="#Note:-Watch-for-Trailing-Spaces" data-toc-modified-id="Note:-Watch-for-Trailing-Spaces-7.4.3"><span class="toc-item-num">7.4.3&nbsp;&nbsp;</span>Note: Watch for Trailing Spaces</a></span></li><li><span><a href="#Caution:-Watch-for-NULL" data-toc-modified-id="Caution:-Watch-for-NULL-7.4.4"><span class="toc-item-num">7.4.4&nbsp;&nbsp;</span>Caution: Watch for NULL</a></span></li></ul></li><li><span><a href="#The-Underscore-(_)-Wildcard" data-toc-modified-id="The-Underscore-(_)-Wildcard-7.5"><span class="toc-item-num">7.5&nbsp;&nbsp;</span>The Underscore (_) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Watch-for-Trailing-Spaces" data-toc-modified-id="Note:-Watch-for-Trailing-Spaces-7.5.1"><span class="toc-item-num">7.5.1&nbsp;&nbsp;</span>Note: Watch for Trailing Spaces</a></span></li></ul></li><li><span><a href="#The-Brackets-([])-Wildcard" data-toc-modified-id="The-Brackets-([])-Wildcard-7.6"><span class="toc-item-num">7.6&nbsp;&nbsp;</span>The Brackets ([]) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Sets-Are-Not-Commonly-Supported" data-toc-modified-id="Note:-Sets-Are-Not-Commonly-Supported-7.6.1"><span class="toc-item-num">7.6.1&nbsp;&nbsp;</span>Note: Sets Are Not Commonly Supported</a></span></li></ul></li><li><span><a href="#Tips-for-Using-Wildcards" data-toc-modified-id="Tips-for-Using-Wildcards-7.7"><span class="toc-item-num">7.7&nbsp;&nbsp;</span>Tips for Using Wildcards</a></span></li></ul></li><li><span><a href="#Creating-Calculated-Fields" data-toc-modified-id="Creating-Calculated-Fields-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Creating Calculated Fields</a></span><ul class="toc-item"><li><span><a href="#Field" data-toc-modified-id="Field-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Field</a></span></li><li><span><a href="#Concatenate" data-toc-modified-id="Concatenate-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Concatenate</a></span><ul class="toc-item"><li><span><a href="#Caution:-Alias-Names" data-toc-modified-id="Caution:-Alias-Names-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Caution: Alias Names</a></span></li><li><span><a href="#The-CONCAT()-function" data-toc-modified-id="The-CONCAT()-function-8.2.2"><span class="toc-item-num">8.2.2&nbsp;&nbsp;</span>The CONCAT() function</a></span><ul class="toc-item"><li><span><a href="#Syntax" data-toc-modified-id="Syntax-8.2.2.1"><span class="toc-item-num">8.2.2.1&nbsp;&nbsp;</span>Syntax</a></span></li></ul></li></ul></li><li><span><a href="#Performing-Mathematical-Calculations" data-toc-modified-id="Performing-Mathematical-Calculations-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>Performing Mathematical Calculations</a></span></li><li><span><a href="#SQL-Mathematical-Operators" data-toc-modified-id="SQL-Mathematical-Operators-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>SQL Mathematical Operators</a></span></li></ul></li><li><span><a href="#Using-Data-Manipulation-Functions" data-toc-modified-id="Using-Data-Manipulation-Functions-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Using Data Manipulation Functions</a></span><ul class="toc-item"><li><span><a href="#Using-Functions" data-toc-modified-id="Using-Functions-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Using Functions</a></span></li><li><span><a href="#Text-Manipulation-Functions" data-toc-modified-id="Text-Manipulation-Functions-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>Text Manipulation Functions</a></span><ul class="toc-item"><li><span><a href="#Tip:-UPPERCASE,-lowercase,-MixedCase" data-toc-modified-id="Tip:-UPPERCASE,-lowercase,-MixedCase-9.2.1"><span class="toc-item-num">9.2.1&nbsp;&nbsp;</span>Tip: UPPERCASE, lowercase, MixedCase</a></span></li></ul></li><li><span><a href="#Date-and-Time-Manipulation-Functions" data-toc-modified-id="Date-and-Time-Manipulation-Functions-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>Date and Time Manipulation Functions</a></span></li><li><span><a href="#Numeric-Manipulation-Functions" data-toc-modified-id="Numeric-Manipulation-Functions-9.4"><span class="toc-item-num">9.4&nbsp;&nbsp;</span>Numeric Manipulation Functions</a></span></li></ul></li><li><span><a href="#Summarizing-Data" data-toc-modified-id="Summarizing-Data-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Summarizing Data</a></span><ul class="toc-item"><li><span><a href="#Using-Aggregate-Functions" data-toc-modified-id="Using-Aggregate-Functions-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Using Aggregate Functions</a></span></li><li><span><a href="#Aggregate-Functions" data-toc-modified-id="Aggregate-Functions-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>Aggregate Functions</a></span><ul class="toc-item"><li><span><a href="#Caution:-Individual-Columns-Only" data-toc-modified-id="Caution:-Individual-Columns-Only-10.2.1"><span class="toc-item-num">10.2.1&nbsp;&nbsp;</span>Caution: Individual Columns Only</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.2.2"><span class="toc-item-num">10.2.2&nbsp;&nbsp;</span>Note: NULL Values</a></span></li></ul></li><li><span><a href="#The-count-values" data-toc-modified-id="The-count-values-10.3"><span class="toc-item-num">10.3&nbsp;&nbsp;</span>The count values</a></span><ul class="toc-item"><li><span><a href="#Tip:-Using-MAX()-with-Nonnumeric-Data" data-toc-modified-id="Tip:-Using-MAX()-with-Nonnumeric-Data-10.3.1"><span class="toc-item-num">10.3.1&nbsp;&nbsp;</span>Tip: Using MAX() with Nonnumeric Data</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.2"><span class="toc-item-num">10.3.2&nbsp;&nbsp;</span>Note: NULL Values</a></span></li><li><span><a href="#Tip:-Using-MIN()-with-Nonnumeric-Data" data-toc-modified-id="Tip:-Using-MIN()-with-Nonnumeric-Data-10.3.3"><span class="toc-item-num">10.3.3&nbsp;&nbsp;</span>Tip: Using MIN() with Nonnumeric Data</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.4"><span class="toc-item-num">10.3.4&nbsp;&nbsp;</span>Note: NULL Values</a></span></li><li><span><a href="#Tip:-Performing-Calculations-on-Multiple-Columns" data-toc-modified-id="Tip:-Performing-Calculations-on-Multiple-Columns-10.3.5"><span class="toc-item-num">10.3.5&nbsp;&nbsp;</span>Tip: Performing Calculations on Multiple Columns</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.6"><span class="toc-item-num">10.3.6&nbsp;&nbsp;</span>Note: NULL Values</a></span></li></ul></li><li><span><a href="#Aggregates-on-Distinct-Values" data-toc-modified-id="Aggregates-on-Distinct-Values-10.4"><span class="toc-item-num">10.4&nbsp;&nbsp;</span>Aggregates on Distinct Values</a></span><ul class="toc-item"><li><span><a href="#Tip:-ALL-Is-Default" data-toc-modified-id="Tip:-ALL-Is-Default-10.4.1"><span class="toc-item-num">10.4.1&nbsp;&nbsp;</span>Tip: ALL Is Default</a></span></li><li><span><a href="#Caution:-No-DISTINCT-with-COUNT(*)" data-toc-modified-id="Caution:-No-DISTINCT-with-COUNT(*)-10.4.2"><span class="toc-item-num">10.4.2&nbsp;&nbsp;</span>Caution: No DISTINCT with COUNT(*)</a></span></li><li><span><a href="#Tip:-Using-DISTINCT-with-MIN()-and-MAX()" data-toc-modified-id="Tip:-Using-DISTINCT-with-MIN()-and-MAX()-10.4.3"><span class="toc-item-num">10.4.3&nbsp;&nbsp;</span>Tip: Using DISTINCT with MIN() and MAX()</a></span></li><li><span><a href="#Note:-Additional-Aggregate-Arguments" data-toc-modified-id="Note:-Additional-Aggregate-Arguments-10.4.4"><span class="toc-item-num">10.4.4&nbsp;&nbsp;</span>Note: Additional Aggregate Arguments</a></span></li><li><span><a href="#Caution:-Naming-Aliases" data-toc-modified-id="Caution:-Naming-Aliases-10.4.5"><span class="toc-item-num">10.4.5&nbsp;&nbsp;</span>Caution: Naming Aliases</a></span></li></ul></li></ul></li><li><span><a href="#Grouping-Data" data-toc-modified-id="Grouping-Data-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Grouping Data</a></span><ul class="toc-item"><li><span><a href="#Filtering-Groups" data-toc-modified-id="Filtering-Groups-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>Filtering Groups</a></span><ul class="toc-item"><li><span><a href="#Tip:-The-ALL-Clause" data-toc-modified-id="Tip:-The-ALL-Clause-11.1.1"><span class="toc-item-num">11.1.1&nbsp;&nbsp;</span>Tip: The ALL Clause</a></span></li><li><span><a href="#Caution:-Specifying-Columns-by-Relative-Position" data-toc-modified-id="Caution:-Specifying-Columns-by-Relative-Position-11.1.2"><span class="toc-item-num">11.1.2&nbsp;&nbsp;</span>Caution: Specifying Columns by Relative Position</a></span></li><li><span><a href="#Tip:-HAVING-Supports-All-WHERE’s-Operators" data-toc-modified-id="Tip:-HAVING-Supports-All-WHERE’s-Operators-11.1.3"><span class="toc-item-num">11.1.3&nbsp;&nbsp;</span>Tip: HAVING Supports All WHERE’s Operators</a></span></li><li><span><a href="#Note:-The-Difference-Between-HAVING-and-WHERE" data-toc-modified-id="Note:-The-Difference-Between-HAVING-and-WHERE-11.1.4"><span class="toc-item-num">11.1.4&nbsp;&nbsp;</span>Note: The Difference Between HAVING and WHERE</a></span></li><li><span><a href="#Note:-Using-HAVING-and-WHERE" data-toc-modified-id="Note:-Using-HAVING-and-WHERE-11.1.5"><span class="toc-item-num">11.1.5&nbsp;&nbsp;</span>Note: Using HAVING and WHERE</a></span></li><li><span><a href="#Tip:-Don’t-Forget-ORDER-BY" data-toc-modified-id="Tip:-Don’t-Forget-ORDER-BY-11.1.6"><span class="toc-item-num">11.1.6&nbsp;&nbsp;</span>Tip: Don’t Forget ORDER BY</a></span></li></ul></li><li><span><a href="#SELECT-Clause-Ordering" data-toc-modified-id="SELECT-Clause-Ordering-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>SELECT Clause Ordering</a></span></li></ul></li><li><span><a href="#Working-with-Subqueries" data-toc-modified-id="Working-with-Subqueries-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Working with Subqueries</a></span><ul class="toc-item"><li><span><a href="#Query" data-toc-modified-id="Query-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>Query</a></span><ul class="toc-item"><li><span><a href="#Caution:-Single-Column-Only" data-toc-modified-id="Caution:-Single-Column-Only-12.1.1"><span class="toc-item-num">12.1.1&nbsp;&nbsp;</span>Caution: Single Column Only</a></span></li><li><span><a href="#Caution:-Subqueries-and-Performance" data-toc-modified-id="Caution:-Subqueries-and-Performance-12.1.2"><span class="toc-item-num">12.1.2&nbsp;&nbsp;</span>Caution: Subqueries and Performance</a></span></li></ul></li><li><span><a href="#Using-Subqueries-as-Calculated-Fields" data-toc-modified-id="Using-Subqueries-as-Calculated-Fields-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span>Using Subqueries as Calculated Fields</a></span><ul class="toc-item"><li><span><a href="#Caution:-Fully-Qualified-Column-Names" data-toc-modified-id="Caution:-Fully-Qualified-Column-Names-12.2.1"><span class="toc-item-num">12.2.1&nbsp;&nbsp;</span>Caution: Fully Qualified Column Names</a></span></li><li><span><a href="#Tip:-Subqueries-May-Not-Always-Be-the-Best-Option" data-toc-modified-id="Tip:-Subqueries-May-Not-Always-Be-the-Best-Option-12.2.2"><span class="toc-item-num">12.2.2&nbsp;&nbsp;</span>Tip: Subqueries May Not Always Be the Best Option</a></span></li></ul></li></ul></li><li><span><a href="#Joining-Tables" data-toc-modified-id="Joining-Tables-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Joining Tables</a></span><ul class="toc-item"><li><span><a href="#Scale" data-toc-modified-id="Scale-13.1"><span class="toc-item-num">13.1&nbsp;&nbsp;</span>Scale</a></span></li><li><span><a href="#Why-Use-Joins?" data-toc-modified-id="Why-Use-Joins?-13.2"><span class="toc-item-num">13.2&nbsp;&nbsp;</span>Why Use Joins?</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Using-Interactive-DBMS-Tools" data-toc-modified-id="Using-Interactive-DBMS-Tools-13.2.0.1"><span class="toc-item-num">13.2.0.1&nbsp;&nbsp;</span>Using Interactive DBMS Tools</a></span></li></ul></li></ul></li><li><span><a href="#Caution:-Fully-Qualifying-Column-Names" data-toc-modified-id="Caution:-Fully-Qualifying-Column-Names-13.3"><span class="toc-item-num">13.3&nbsp;&nbsp;</span>Caution: Fully Qualifying Column Names</a></span></li><li><span><a href="#Cartesian-Product" data-toc-modified-id="Cartesian-Product-13.4"><span class="toc-item-num">13.4&nbsp;&nbsp;</span>Cartesian Product</a></span><ul class="toc-item"><li><span><a href="#Caution:-Don’t-Forget-the-WHERE-Clause" data-toc-modified-id="Caution:-Don’t-Forget-the-WHERE-Clause-13.4.1"><span class="toc-item-num">13.4.1&nbsp;&nbsp;</span>Caution: Don’t Forget the WHERE Clause</a></span><ul class="toc-item"><li><span><a href="#Tip:-Cross-Joins" data-toc-modified-id="Tip:-Cross-Joins-13.4.1.1"><span class="toc-item-num">13.4.1.1&nbsp;&nbsp;</span>Tip: Cross Joins</a></span></li></ul></li></ul></li><li><span><a href="#Inner-Joins" data-toc-modified-id="Inner-Joins-13.5"><span class="toc-item-num">13.5&nbsp;&nbsp;</span>Inner Joins</a></span><ul class="toc-item"><li><span><a href="#Inner-joins-narrow-down-the-set-of-rows-returns." data-toc-modified-id="Inner-joins-narrow-down-the-set-of-rows-returns.-13.5.1"><span class="toc-item-num">13.5.1&nbsp;&nbsp;</span>Inner joins narrow down the set of rows returns.</a></span></li><li><span><a href="#Outer-joins-(left-or-right)-don't-change-number-of-rows-returned,-but-just-&quot;pick-up&quot;-additional-columns-if-possible." data-toc-modified-id="Outer-joins-(left-or-right)-don't-change-number-of-rows-returned,-but-just-&quot;pick-up&quot;-additional-columns-if-possible.-13.5.2"><span class="toc-item-num">13.5.2&nbsp;&nbsp;</span>Outer joins (left or right) don't change number of rows returned, but just "pick up" additional columns if possible.</a></span></li><li><span><a href="#An-INNER-JOIN-will-only-return-the-rows-where-there-are-matching-values-in-both-tables,-whereas-a-LEFT-JOIN-will-return-ALL-the-rows-from-the-LEFT-table-even-if-there-is-no-matching-row-in-the-RIGHT-table." data-toc-modified-id="An-INNER-JOIN-will-only-return-the-rows-where-there-are-matching-values-in-both-tables,-whereas-a-LEFT-JOIN-will-return-ALL-the-rows-from-the-LEFT-table-even-if-there-is-no-matching-row-in-the-RIGHT-table.-13.5.3"><span class="toc-item-num">13.5.3&nbsp;&nbsp;</span>An INNER JOIN will only return the rows where there are matching values in both tables, whereas a LEFT JOIN will return ALL the rows from the LEFT table even if there is no matching row in the RIGHT table.</a></span></li><li><span><a href="#Note:-The-“Right”-Syntax" data-toc-modified-id="Note:-The-“Right”-Syntax-13.5.4"><span class="toc-item-num">13.5.4&nbsp;&nbsp;</span>Note: The “Right” Syntax</a></span></li></ul></li><li><span><a href="#Joining-Multiple-Tables" data-toc-modified-id="Joining-Multiple-Tables-13.6"><span class="toc-item-num">13.6&nbsp;&nbsp;</span>Joining Multiple Tables</a></span><ul class="toc-item"><li><span><a href="#Caution:-Performance-Considerations" data-toc-modified-id="Caution:-Performance-Considerations-13.6.1"><span class="toc-item-num">13.6.1&nbsp;&nbsp;</span>Caution: Performance Considerations</a></span></li><li><span><a href="#Caution:-Maximum-Number-of-Tables-in-a-Join" data-toc-modified-id="Caution:-Maximum-Number-of-Tables-in-a-Join-13.6.2"><span class="toc-item-num">13.6.2&nbsp;&nbsp;</span>Caution: Maximum Number of Tables in a Join</a></span></li><li><span><a href="#Tip:-It-Pays-to-Experiment" data-toc-modified-id="Tip:-It-Pays-to-Experiment-13.6.3"><span class="toc-item-num">13.6.3&nbsp;&nbsp;</span>Tip: It Pays to Experiment</a></span><ul class="toc-item"><li><span><a href="#Note:-Joined-Column-Names" data-toc-modified-id="Note:-Joined-Column-Names-13.6.3.1"><span class="toc-item-num">13.6.3.1&nbsp;&nbsp;</span>Note: Joined Column Names</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Creating-Advanced-Joins" data-toc-modified-id="Creating-Advanced-Joins-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Creating Advanced Joins</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Caution:-No-AS-in-Oracle" data-toc-modified-id="Caution:-No-AS-in-Oracle-14.0.1"><span class="toc-item-num">14.0.1&nbsp;&nbsp;</span>Caution: No AS in Oracle</a></span></li><li><span><a href="#Tip:-No-AS-in-Oracle" data-toc-modified-id="Tip:-No-AS-in-Oracle-14.0.2"><span class="toc-item-num">14.0.2&nbsp;&nbsp;</span>Tip: No AS in Oracle</a></span></li></ul></li><li><span><a href="#Using-Different-Join-Types" data-toc-modified-id="Using-Different-Join-Types-14.1"><span class="toc-item-num">14.1&nbsp;&nbsp;</span>Using Different Join Types</a></span></li><li><span><a href="#Self-Joins" data-toc-modified-id="Self-Joins-14.2"><span class="toc-item-num">14.2&nbsp;&nbsp;</span>Self Joins</a></span><ul class="toc-item"><li><span><a href="#Tip:-Self-Joins-Instead-of-Subqueries" data-toc-modified-id="Tip:-Self-Joins-Instead-of-Subqueries-14.2.1"><span class="toc-item-num">14.2.1&nbsp;&nbsp;</span>Tip: Self Joins Instead of Subqueries</a></span></li></ul></li><li><span><a href="#Natural-Joins-▾" data-toc-modified-id="Natural-Joins-▾-14.3"><span class="toc-item-num">14.3&nbsp;&nbsp;</span>Natural Joins ▾</a></span></li><li><span><a href="#Outer-Joins" data-toc-modified-id="Outer-Joins-14.4"><span class="toc-item-num">14.4&nbsp;&nbsp;</span>Outer Joins</a></span><ul class="toc-item"><li><span><a href="#Caution:-Syntax-Differences" data-toc-modified-id="Caution:-Syntax-Differences-14.4.1"><span class="toc-item-num">14.4.1&nbsp;&nbsp;</span>Caution: Syntax Differences</a></span></li><li><span><a href="#Using-Joins-and-Join-Conditions" data-toc-modified-id="Using-Joins-and-Join-Conditions-14.4.2"><span class="toc-item-num">14.4.2&nbsp;&nbsp;</span>Using Joins and Join Conditions</a></span></li></ul></li></ul></li><li><span><a href="#Combining-Queries" data-toc-modified-id="Combining-Queries-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Combining Queries</a></span><ul class="toc-item"><li><span><a href="#UNION-Rules" data-toc-modified-id="UNION-Rules-15.1"><span class="toc-item-num">15.1&nbsp;&nbsp;</span>UNION Rules</a></span><ul class="toc-item"><li><span><a href="#Note:-UNION-Column-Names" data-toc-modified-id="Note:-UNION-Column-Names-15.1.1"><span class="toc-item-num">15.1.1&nbsp;&nbsp;</span>Note: UNION Column Names</a></span></li></ul></li><li><span><a href="#Including-or-Eliminating-Duplicate-Rows" data-toc-modified-id="Including-or-Eliminating-Duplicate-Rows-15.2"><span class="toc-item-num">15.2&nbsp;&nbsp;</span>Including or Eliminating Duplicate Rows</a></span><ul class="toc-item"><li><span><a href="#Tip:-UNION-Versus-WHERE" data-toc-modified-id="Tip:-UNION-Versus-WHERE-15.2.1"><span class="toc-item-num">15.2.1&nbsp;&nbsp;</span>Tip: UNION Versus WHERE</a></span></li></ul></li><li><span><a href="#Sorting-Combined-Query-Results" data-toc-modified-id="Sorting-Combined-Query-Results-15.3"><span class="toc-item-num">15.3&nbsp;&nbsp;</span>Sorting Combined Query Results</a></span><ul class="toc-item"><li><span><a href="#Note:-Other-UNION-Types" data-toc-modified-id="Note:-Other-UNION-Types-15.3.1"><span class="toc-item-num">15.3.1&nbsp;&nbsp;</span>Note: Other UNION Types</a></span></li><li><span><a href="#Tip:-Working-with-Multiple-Tables" data-toc-modified-id="Tip:-Working-with-Multiple-Tables-15.3.2"><span class="toc-item-num">15.3.2&nbsp;&nbsp;</span>Tip: Working with Multiple Tables</a></span></li></ul></li></ul></li><li><span><a href="#Inserting-Data" data-toc-modified-id="Inserting-Data-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>Inserting Data</a></span><ul class="toc-item"><li><span><a href="#Note:-Can’t-INSERT-Same-Record-Twice" data-toc-modified-id="Note:-Can’t-INSERT-Same-Record-Twice-16.1"><span class="toc-item-num">16.1&nbsp;&nbsp;</span>Note: Can’t INSERT Same Record Twice</a></span><ul class="toc-item"><li><span><a href="#Tip:-Always-Use-a-Columns-List" data-toc-modified-id="Tip:-Always-Use-a-Columns-List-16.1.1"><span class="toc-item-num">16.1.1&nbsp;&nbsp;</span>Tip: Always Use a Columns List</a></span></li><li><span><a href="#Caution:-Use-VALUES-Carefully" data-toc-modified-id="Caution:-Use-VALUES-Carefully-16.1.2"><span class="toc-item-num">16.1.2&nbsp;&nbsp;</span>Caution: Use VALUES Carefully</a></span></li></ul></li><li><span><a href="#Inserting-Partial-Rows" data-toc-modified-id="Inserting-Partial-Rows-16.2"><span class="toc-item-num">16.2&nbsp;&nbsp;</span>Inserting Partial Rows</a></span><ul class="toc-item"><li><span><a href="#Caution:-Omitting-Columns" data-toc-modified-id="Caution:-Omitting-Columns-16.2.1"><span class="toc-item-num">16.2.1&nbsp;&nbsp;</span>Caution: Omitting Columns</a></span></li><li><span><a href="#Caution:-Omitting-Required-Values" data-toc-modified-id="Caution:-Omitting-Required-Values-16.2.2"><span class="toc-item-num">16.2.2&nbsp;&nbsp;</span>Caution: Omitting Required Values</a></span></li></ul></li><li><span><a href="#Inserting-Retrieved-Data" data-toc-modified-id="Inserting-Retrieved-Data-16.3"><span class="toc-item-num">16.3&nbsp;&nbsp;</span>Inserting Retrieved Data</a></span></li><li><span><a href="#Copying-from-One-Table-to-Another" data-toc-modified-id="Copying-from-One-Table-to-Another-16.4"><span class="toc-item-num">16.4&nbsp;&nbsp;</span>Copying from One Table to Another</a></span></li></ul></li><li><span><a href="#Updating-and-Deleting-Data" data-toc-modified-id="Updating-and-Deleting-Data-17"><span class="toc-item-num">17&nbsp;&nbsp;</span>Updating and Deleting Data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Caution:-Don’t-Omit-the-WHERE-Clause" data-toc-modified-id="Caution:-Don’t-Omit-the-WHERE-Clause-17.0.1"><span class="toc-item-num">17.0.1&nbsp;&nbsp;</span>Caution: Don’t Omit the WHERE Clause</a></span></li><li><span><a href="#Tip:-UPDATE-and-Security" data-toc-modified-id="Tip:-UPDATE-and-Security-17.0.2"><span class="toc-item-num">17.0.2&nbsp;&nbsp;</span>Tip: UPDATE and Security</a></span><ul class="toc-item"><li><span><a href="#Tip:-Using-Subqueries-in-an-UPDATE-Statement" data-toc-modified-id="Tip:-Using-Subqueries-in-an-UPDATE-Statement-17.0.2.1"><span class="toc-item-num">17.0.2.1&nbsp;&nbsp;</span>Tip: Using Subqueries in an UPDATE Statement</a></span></li></ul></li><li><span><a href="#Tip:-The-FROM-Keyword" data-toc-modified-id="Tip:-The-FROM-Keyword-17.0.3"><span class="toc-item-num">17.0.3&nbsp;&nbsp;</span>Tip: The FROM Keyword</a></span></li></ul></li><li><span><a href="#Deleting-Data" data-toc-modified-id="Deleting-Data-17.1"><span class="toc-item-num">17.1&nbsp;&nbsp;</span>Deleting Data</a></span><ul class="toc-item"><li><span><a href="#Caution:-Don’t-Omit-the-WHERE-Clause" data-toc-modified-id="Caution:-Don’t-Omit-the-WHERE-Clause-17.1.1"><span class="toc-item-num">17.1.1&nbsp;&nbsp;</span>Caution: Don’t Omit the WHERE Clause</a></span></li><li><span><a href="#Note:" data-toc-modified-id="Note:-17.1.2"><span class="toc-item-num">17.1.2&nbsp;&nbsp;</span>Note:</a></span></li><li><span><a href="#Tip:-Faster-Deletes" data-toc-modified-id="Tip:-Faster-Deletes-17.1.3"><span class="toc-item-num">17.1.3&nbsp;&nbsp;</span>Tip: Faster Deletes</a></span></li><li><span><a href="#Here-are-some-important-guidelines-that-many-SQL-programmers-follow:" data-toc-modified-id="Here-are-some-important-guidelines-that-many-SQL-programmers-follow:-17.1.4"><span class="toc-item-num">17.1.4&nbsp;&nbsp;</span>Here are some important guidelines that many SQL programmers follow:</a></span></li></ul></li></ul></li><li><span><a href="#Creating-and-Manipulating-Tables" data-toc-modified-id="Creating-and-Manipulating-Tables-18"><span class="toc-item-num">18&nbsp;&nbsp;</span>Creating and Manipulating Tables</a></span><ul class="toc-item"><li><span><a href="#There-are-generally-two-ways-to-create-database-tables:" data-toc-modified-id="There-are-generally-two-ways-to-create-database-tables:-18.1"><span class="toc-item-num">18.1&nbsp;&nbsp;</span>There are generally two ways to create database tables:</a></span><ul class="toc-item"><li><span><a href="#Tip:-Statement-Formatting" data-toc-modified-id="Tip:-Statement-Formatting-18.1.1"><span class="toc-item-num">18.1.1&nbsp;&nbsp;</span>Tip: Statement Formatting</a></span></li><li><span><a href="#Tip:-Replacing-Existing-Tables" data-toc-modified-id="Tip:-Replacing-Existing-Tables-18.1.2"><span class="toc-item-num">18.1.2&nbsp;&nbsp;</span>Tip: Replacing Existing Tables</a></span></li></ul></li><li><span><a href="#Working-with-NULL-Values" data-toc-modified-id="Working-with-NULL-Values-18.2"><span class="toc-item-num">18.2&nbsp;&nbsp;</span>Working with NULL Values</a></span><ul class="toc-item"><li><span><a href="#Caution:-Understanding-NULL" data-toc-modified-id="Caution:-Understanding-NULL-18.2.1"><span class="toc-item-num">18.2.1&nbsp;&nbsp;</span>Caution: Understanding NULL</a></span></li></ul></li><li><span><a href="#Specifying-Default-Values" data-toc-modified-id="Specifying-Default-Values-18.3"><span class="toc-item-num">18.3&nbsp;&nbsp;</span>Specifying Default Values</a></span></li><li><span><a href="#Updating-Tables" data-toc-modified-id="Updating-Tables-18.4"><span class="toc-item-num">18.4&nbsp;&nbsp;</span>Updating Tables</a></span><ul class="toc-item"><li><span><a href="#Complex-table-structure-changes-usually-require-a-manual-move-process" data-toc-modified-id="Complex-table-structure-changes-usually-require-a-manual-move-process-18.4.1"><span class="toc-item-num">18.4.1&nbsp;&nbsp;</span>Complex table structure changes usually require a manual move process</a></span></li><li><span><a href="#Note:-ALTER-TABLE-and-SQLite" data-toc-modified-id="Note:-ALTER-TABLE-and-SQLite-18.4.2"><span class="toc-item-num">18.4.2&nbsp;&nbsp;</span>Note: ALTER TABLE and SQLite</a></span></li><li><span><a href="#Caution:-Use-ALTER-TABLE-Carefully" data-toc-modified-id="Caution:-Use-ALTER-TABLE-Carefully-18.4.3"><span class="toc-item-num">18.4.3&nbsp;&nbsp;</span>Caution: Use ALTER TABLE Carefully</a></span></li></ul></li><li><span><a href="#Deleting-Tables" data-toc-modified-id="Deleting-Tables-18.5"><span class="toc-item-num">18.5&nbsp;&nbsp;</span>Deleting Tables</a></span></li></ul></li><li><span><a href="#Using-Views" data-toc-modified-id="Using-Views-19"><span class="toc-item-num">19&nbsp;&nbsp;</span>Using Views</a></span><ul class="toc-item"><li><span><a href="#Note:-Views-in-SQLite" data-toc-modified-id="Note:-Views-in-SQLite-19.1"><span class="toc-item-num">19.1&nbsp;&nbsp;</span>Note: Views in SQLite</a></span></li><li><span><a href="#Why-Use-Views" data-toc-modified-id="Why-Use-Views-19.2"><span class="toc-item-num">19.2&nbsp;&nbsp;</span>Why Use Views</a></span><ul class="toc-item"><li><span><a href="#Caution:-Performance-Issues" data-toc-modified-id="Caution:-Performance-Issues-19.2.1"><span class="toc-item-num">19.2.1&nbsp;&nbsp;</span>Caution: Performance Issues</a></span></li></ul></li><li><span><a href="#View-Rules-and-Restrictions" data-toc-modified-id="View-Rules-and-Restrictions-19.3"><span class="toc-item-num">19.3&nbsp;&nbsp;</span>View Rules and Restrictions</a></span></li><li><span><a href="#Creating-Views" data-toc-modified-id="Creating-Views-19.4"><span class="toc-item-num">19.4&nbsp;&nbsp;</span>Creating Views</a></span><ul class="toc-item"><li><span><a href="#Note:-Renaming-Views" data-toc-modified-id="Note:-Renaming-Views-19.4.1"><span class="toc-item-num">19.4.1&nbsp;&nbsp;</span>Note: Renaming Views</a></span></li><li><span><a href="#Tip:-Creating-Reusable-Views" data-toc-modified-id="Tip:-Creating-Reusable-Views-19.4.2"><span class="toc-item-num">19.4.2&nbsp;&nbsp;</span>Tip: Creating Reusable Views</a></span></li></ul></li><li><span><a href="#Using-Views-to-Reformat-Retrieved-Data" data-toc-modified-id="Using-Views-to-Reformat-Retrieved-Data-19.5"><span class="toc-item-num">19.5&nbsp;&nbsp;</span>Using Views to Reformat Retrieved Data</a></span><ul class="toc-item"><li><span><a href="#Note:-SELECT-Restrictions-All-Apply" data-toc-modified-id="Note:-SELECT-Restrictions-All-Apply-19.5.1"><span class="toc-item-num">19.5.1&nbsp;&nbsp;</span>Note: SELECT Restrictions All Apply</a></span></li></ul></li><li><span><a href="#Using-Views-to-Filter-Unwanted-Data" data-toc-modified-id="Using-Views-to-Filter-Unwanted-Data-19.6"><span class="toc-item-num">19.6&nbsp;&nbsp;</span>Using Views to Filter Unwanted Data</a></span><ul class="toc-item"><li><span><a href="#Note:-WHERE-Clauses-and-WHERE-Clauses" data-toc-modified-id="Note:-WHERE-Clauses-and-WHERE-Clauses-19.6.1"><span class="toc-item-num">19.6.1&nbsp;&nbsp;</span>Note: WHERE Clauses and WHERE Clauses</a></span></li></ul></li><li><span><a href="#Using-Views-with-Calculated-Fields" data-toc-modified-id="Using-Views-with-Calculated-Fields-19.7"><span class="toc-item-num">19.7&nbsp;&nbsp;</span>Using Views with Calculated Fields</a></span></li></ul></li><li><span><a href="#Working-with-Stored-Procedures" data-toc-modified-id="Working-with-Stored-Procedures-20"><span class="toc-item-num">20&nbsp;&nbsp;</span>Working with Stored Procedures</a></span></li></ul></div>

# Learning SQL

* Source code for  Sams Teach Yourself SQL in 10 Minutes Fifth Edition Ben Forta code: 

https://forta.com/books/0135182794/


* challenges
https://forta.com/books/0135182794/challenges/



1-  Introduction to SQL
- SQL is a standard language query for storing, manipulating and retrieving data in databases.
- Our SQL tutorial will teach you how to use SQL in: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres, and other database systems.
- SQL is a standard language for accessing and manipulating databases.

2- What is SQL?
* SQL stands for Structured Query Language
* SQL lets you access and manipulate databases
* SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987

3- What Can SQL do?
* SQL can execute queries against a database
* SQL can retrieve data from a database
* SQL can insert records in a database
* SQL can update records in a database
* SQL can delete records from a database
* SQL can create new databases
* SQL can create new tables in a database
* SQL can create stored procedures in a database
* SQL can create views in a database
* SQL can set permissions on tables, procedures, and views

## RDBMS

RDBMS stands for Relational Database Management System.

RDBMS is the basis for SQL, and for all modern database systems such as MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.

The data in RDBMS is stored in database objects called tables. A table is a collection of related data entries and it consists of columns and rows.

Look at the "Customers" table:

## Database : 
A container (usually a file or set of files) to store organized data. People often use the term database to refer to the database software they are running. This is incorrect and a source of much confusion. 

Database software
is actually called the Database Management System (or DBMS). The
database is the container created and manipulated via the DBMS, and exactly
what the database is and what form it takes vary from one database to the
next.

## Table
A structured list of data of a specific type.
## Table Names
What makes a table name unique is actually a combination of several things
including the database name and table name. Some databases also use the
name of the database owner as part of the unique name. 

This means that while
you cannot use the same table name twice in the same database, you definitely
can reuse table names in different databases.

## Schema
Information about database and table layout and properties.

## Column
A single field in a table. All tables are made up of one or more columns.

## Breaking Up Data
It is extremely important to break data into multiple columns correctly. For
example, city, state, and ZIP (or postal) code should always be separate
columns. When you break these out, it becomes possible to sort or filter data
by specific columns (for example, to find all customers in a particular state or
in a particular city). If city and state are combined into one column, it would
be extremely difficult to sort or filter by state.

When you break up data, the level of granularity is up to you and your
specific requirements. For example, addresses are typically stored with the
house number and street name together. This is fine, unless you might one day
need to sort data by street name, in which case splitting house number and
street name would be preferable.

## Datatype
A type of allowed data. Every table column has an associated datatype that
restricts (or allows) specific data in that column.

## Datatype Compatibility
Datatypes and their names are one of the primary sources of SQL
incompatibility. While most basic datatypes are supported consistently, many
more advanced datatypes are not. And worse, occasionally you’ll find that the
same datatype is referred to by different names in different DBMSs. There is
not much you can do about this, but it is important to keep in mind when you
create table schemas.

## Row
A record in a table.

## Primary key
A column (or set of columns) whose values uniquely identify every row in a
table.


## Always Define Primary Keys
Although primary keys are not actually required, most database designers
ensure that every table they create has a primary key so that future data
manipulation is possible and manageable.

Any column in a table can be defined as the primary key, as long as it meets the
following conditions:
- No two rows can have the same primary key value.
- Every row must have a value in the primary key column(s). (So, no NULL values.)
- Values in primary key columns should never be modified or updated.
- Primary key values should never be reused. (If a row is deleted from the table, its primary key may not be assigned to any new rows in the future.)

## What Is SQL?
SQL (pronounced as the letters S-Q-L or as sequel) is an abbreviation for
Structured Query Language. SQL is a language designed specifically for
communicating with databases.

## SQL Extensions
Many DBMS vendors have extended their support for SQL by adding
statements or instructions to the language. The purpose of these extensions is
to provide additional functionality or simplified ways to perform specific
operations. And while often extremely useful, these extensions tend to be very
DBMS specific, and they are rarely supported by more than a single vendor.
Standard SQL is governed by the ANSI standards committee, and is thus
called ANSI SQL. All major DBMSs, even those with their own extensions,
support ANSI SQL. Individual implementations have their own names (PLSQL, used by Oracle; Transact-SQL, used by Microsoft SQL Server; and so
on).
For the most part, the SQL taught in this book is ANSI SQL. On the odd
occasion where DBMS-specific SQL is used, it is so noted.

![](./i/er_24.png)

![](./i/6YuwE.jpg)

# SQL Statement Syntax

``` mysql

ALTER TABLE tablename
(
ADD|DROP column datatype [NULL|NOT NULL] [CONSTRAINTS],
ADD|DROP column datatype [NULL|NOT NULL] [CONSTRAINTS],
...
);



COMMIT [TRANSACTION];



CREATE INDEX indexname
ON tablename (column, ...);



CREATE PROCEDURE procedurename [parameters] [options]
AS
SQL statement;




CREATE TABLE tablename
(
column datatype [NULL|NOT NULL] [CONSTRAINTS],
column datatype [NULL|NOT NULL] [CONSTRAINTS],
...
);




CREATE VIEW viewname AS
SELECT columns, ...
FROM tables, ...
[WHERE ...]
[GROUP BY ...]
[HAVING ...];



DELETE FROM tablename
[WHERE ...];



DROP INDEX|PROCEDURE|TABLE|VIEW indexname|procedurename|tablename|
viewname;



INSERT INTO tablename [(columns, ...)]
VALUES(values, ...);



INSERT INTO tablename [(columns, ...)]
SELECT columns, ... FROM tablename, ...
[WHERE ...];



ROLLBACK [TO savepointname];
OR
ROLLBACK TRANSACTION;



SELECT columnname, ...
FROM tablename, ...
[WHERE ...]
[UNION ...]
[GROUP BY ...]
[HAVING ...]
[ORDER BY ...];



UPDATE tablename
SET columname = value, ...
[WHERE ...];


```

In [1]:
# Create Connection

In [5]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="YourPAss",
)



print(mydb)
mycursor = mydb.cursor()
# Check if Database Exists

<mysql.connector.connection.MySQLConnection object at 0x00000275FEBBFE08>

In [6]:
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)
# mycursor.execute("CREATE DATABASE mydatabase")
print("Done")

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sql_cookbook',)
('sys',)
('teach_yourself_sql',)
('world',)
Done

``` mysql


create database teach_yourself_sql;

use teach_yourself_sql;



-- ----------------------
-- Create Customers table
-- ----------------------
CREATE TABLE Customers
(
  cust_id      char(10)  NOT NULL ,
  cust_name    char(50)  NOT NULL ,
  cust_address char(50)  NULL ,
  cust_city    char(50)  NULL ,
  cust_state   char(5)   NULL ,
  cust_zip     char(10)  NULL ,
  cust_country char(50)  NULL ,
  cust_contact char(50)  NULL ,
  cust_email   char(255) NULL 
);

-- -----------------------
-- Create OrderItems table
-- -----------------------
CREATE TABLE OrderItems
(
  order_num  int          NOT NULL ,
  order_item int          NOT NULL ,
  prod_id    char(10)     NOT NULL ,
  quantity   int          NOT NULL ,
  item_price decimal(8,2) NOT NULL 
);


-- -------------------
-- Create Orders table
-- -------------------
CREATE TABLE Orders
(
  order_num  int      NOT NULL ,
  order_date datetime NOT NULL ,
  cust_id    char(10) NOT NULL 
);

-- ---------------------
-- Create Products table
-- ---------------------
CREATE TABLE Products
(
  prod_id    char(10)      NOT NULL ,
  vend_id    char(10)      NOT NULL ,
  prod_name  char(255)     NOT NULL ,
  prod_price decimal(8,2)  NOT NULL ,
  prod_desc  text          NULL 
);

-- --------------------
-- Create Vendors table
-- --------------------
CREATE TABLE Vendors
(
  vend_id      char(10) NOT NULL ,
  vend_name    char(50) NOT NULL ,
  vend_address char(50) NULL ,
  vend_city    char(50) NULL ,
  vend_state   char(5)  NULL ,
  vend_zip     char(10) NULL ,
  vend_country char(50) NULL 
);


-- -------------------
-- Define primary keys
-- -------------------
ALTER TABLE Customers ADD PRIMARY KEY (cust_id);
ALTER TABLE OrderItems ADD PRIMARY KEY (order_num, order_item);
ALTER TABLE Orders ADD PRIMARY KEY (order_num);
ALTER TABLE Products ADD PRIMARY KEY (prod_id);
ALTER TABLE Vendors ADD PRIMARY KEY (vend_id);


-- -------------------
-- Define foreign keys
-- -------------------
ALTER TABLE OrderItems ADD CONSTRAINT FK_OrderItems_Orders FOREIGN KEY (order_num) REFERENCES Orders (order_num);
ALTER TABLE OrderItems ADD CONSTRAINT FK_OrderItems_Products FOREIGN KEY (prod_id) REFERENCES Products (prod_id);
ALTER TABLE Orders ADD CONSTRAINT FK_Orders_Customers FOREIGN KEY (cust_id) REFERENCES Customers (cust_id);
ALTER TABLE Products ADD CONSTRAINT FK_Products_Vendors FOREIGN KEY (vend_id) REFERENCES Vendors (vend_id);




-- ------------------------
-- Populate Customers table
-- ------------------------
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact)
VALUES('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact)
VALUES('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard');

-- ----------------------
-- Populate Vendors table
-- ----------------------
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('BRS01','Bears R Us','123 Main Street','Bear Town','MI','44444', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('BRE02','Bear Emporium','500 Park Street','Anytown','OH','44333', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('DLL01','Doll House Inc.','555 High Street','Dollsville','CA','99999', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('FRB01','Furball Inc.','1000 5th Avenue','New York','NY','11111', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('FNG01','Fun and Games','42 Galaxy Road','London', NULL,'N16 6PS', 'England');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('JTS01','Jouets et ours','1 Rue Amusement','Paris', NULL,'45678', 'France');

-- -----------------------
-- Populate Products table
-- -----------------------
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR01', 'BRS01', '8 inch teddy bear', 5.99, '8 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR02', 'BRS01', '12 inch teddy bear', 8.99, '12 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR03', 'BRS01', '18 inch teddy bear', 11.99, '18 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG01', 'DLL01', 'Fish bean bag toy', 3.49, 'Fish bean bag toy, complete with bean bag worms with which to feed it');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG02', 'DLL01', 'Bird bean bag toy', 3.49, 'Bird bean bag toy, eggs are not included');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG03', 'DLL01', 'Rabbit bean bag toy', 3.49, 'Rabbit bean bag toy, comes with bean bag carrots');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RGAN01', 'DLL01', 'Raggedy Ann', 4.99, '18 inch Raggedy Ann doll');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RYL01', 'FNG01', 'King doll', 9.49, '12 inch king doll with royal garments and crown');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RYL02', 'FNG01', 'Queen doll', 9.49, '12 inch queen doll with royal garments and crown');

-- ---------------------
-- Populate Orders table
-- ---------------------
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20005, '2020-05-01', '1000000001');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20006, '2020-01-12', '1000000003');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20007, '2020-01-30', '1000000004');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20008, '2020-02-03', '1000000005');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20009, '2020-02-08', '1000000001');

-- -------------------------
-- Populate OrderItems table
-- -------------------------
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20005, 1, 'BR01', 100, 5.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20005, 2, 'BR03', 100, 10.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 1, 'BR01', 20, 5.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 2, 'BR02', 10, 8.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 3, 'BR03', 10, 11.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 1, 'BR03', 50, 11.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 2, 'BNBG01', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 3, 'BNBG02', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 4, 'BNBG03', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 5, 'RGAN01', 50, 4.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 1, 'RGAN01', 5, 4.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 2, 'BR03', 5, 11.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 3, 'BNBG01', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 4, 'BNBG02', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 5, 'BNBG03', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 1, 'BNBG01', 250, 2.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 2, 'BNBG02', 250, 2.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 3, 'BNBG03', 250, 2.49);
```

#  Retrieving Data
It is important to note that SQL statements are not case sensitive, so SELECT is
the same as select, which is the same as Select. Many SQL developers find
that using uppercase for all SQL keywords and lowercase for column and
table names makes code easier to read and debug. However, be aware that
while the SQL language is case-insensitive, the names of tables, columns, and
values may not be (that depends on your DBMS and how it is configured).


pip install mysql-connector

pip install mysql

In [7]:
# Create connection:
import mysql.connector
import pandas as pd
def query(query):
        mySql_connector = mysql.connector.connect(
        host="localhost", 
        user="root",
        passwd="YourPAss",
        database="teach_yourself_sql" , use_pure=True
        )
        
        data= pd.read_sql_query(query , mySql_connector  )
        return data
    
'''order = 10100
status = 'Shipped'
sql = """SELECT  * from orders where orderNumber = ?
         and status = ? order by orderNumber"""
df1 = pd.read_sql_query(sql, cnx, params=[order, status])
'''


data=query("""
SELECT prod_name
FROM Products;


""")
data

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear
5   18 inch teddy bear
6          Raggedy Ann
7            King doll
8           Queen doll

In [8]:
data=query("""
SELECT prod_id, prod_name, prod_price
FROM Products;
""")
data

  prod_id            prod_name  prod_price
0  BNBG01    Fish bean bag toy        3.49
1  BNBG02    Bird bean bag toy        3.49
2  BNBG03  Rabbit bean bag toy        3.49
3    BR01    8 inch teddy bear        5.99
4    BR02   12 inch teddy bear        8.99
5    BR03   18 inch teddy bear       11.99
6  RGAN01          Raggedy Ann        4.99
7   RYL01            King doll        9.49
8   RYL02           Queen doll        9.49

## Presentation of Data
SQL statements typically return raw, unformatted data, and different DBMSs
and clients may display the data differently (with different alignment or
decimal places, for example). Data formatting is a presentation issue, not a
retrieval issue. Therefore, presentation is typically specified in the
application that displays the data. Actual retrieved data (without applicationprovided formatting) is rarely used.


## wildcard (*):

`As a rule, you are better off not using the * wildcard unless you really do
need every column in the table. Even though use of wildcards may save youthe time and effort needed to list the desired columns explicitly, retrieving
unnecessary columns usually slows down the performance of your retrieval
and your application.`

In [9]:
data=query("""
SELECT *
FROM Products;
""")
data

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
1,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"
2,BNBG03,DLL01,Rabbit bean bag toy,3.49,"Rabbit bean bag toy, comes with bean bag carrots"
3,BR01,BRS01,8 inch teddy bear,5.99,"8 inch teddy bear, comes with cap and jacket"
4,BR02,BRS01,12 inch teddy bear,8.99,"12 inch teddy bear, comes with cap and jacket"
5,BR03,BRS01,18 inch teddy bear,11.99,"18 inch teddy bear, comes with cap and jacket"
6,RGAN01,DLL01,Raggedy Ann,4.99,18 inch Raggedy Ann doll
7,RYL01,FNG01,King doll,9.49,12 inch king doll with royal garments and crown
8,RYL02,FNG01,Queen doll,9.49,12 inch queen doll with royal garments and crown

In [10]:
data=query("""
SELECT distinct vend_id
FROM Products;
""")
data

  vend_id
0   BRS01
1   DLL01
2   FNG01

## Distinct row

SELECT DISTINCT vend_id tells the DBMS to only return distinct (unique) vend_id
rows, and so only three rows are returned, as seen in the following output. If
used, the DISTINCT keyword must be placed directly in front of the column names 
### Caution: Can’t Be Partially DISTINCT
The DISTINCT keyword applies to all columns, not just the one it precedes. If
you were to specify SELECT DISTINCT vend_id, prod_price, six of the nine
rows would be retrieved because the combined specified columns produced
six unique combinations.

In [11]:
query("SELECT  vend_id, prod_price FROM Products;")

  vend_id  prod_price
0   DLL01        3.49
1   DLL01        3.49
2   DLL01        3.49
3   BRS01        5.99
4   BRS01        8.99
5   BRS01       11.99
6   DLL01        4.99
7   FNG01        9.49
8   FNG01        9.49

In [12]:
query("SELECT DISTINCT vend_id, prod_price FROM Products;")

  vend_id  prod_price
0   DLL01        3.49
1   BRS01        5.99
2   BRS01        8.99
3   BRS01       11.99
4   DLL01        4.99
5   FNG01        9.49

## Limiting Results
The previous statement uses the SELECT statement to retrieve a single column.
LIMIT 5 instructs the supported DBMSs to return no more than five rows. The
output from this statement is shown in the following code.

In [13]:
query('''SELECT prod_name
FROM Products
''')

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear
5   18 inch teddy bear
6          Raggedy Ann
7            King doll
8           Queen doll

In [14]:
query('''SELECT prod_name
FROM Products
LIMIT 5 ''')

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear

## OFFSET 5 
LIMIT 5 OFFSET 5 instructs supported DBMSs to return five rows starting from
row 5. The first number is the number of rows to retrieve, and the second is
where to start.

In [15]:
query('''SELECT prod_name
FROM Products
LIMIT 5 OFFSET 5;''')

            prod_name
0  18 inch teddy bear
1         Raggedy Ann
2           King doll
3          Queen doll

### Caution: Row 0
The first row retrieved is row 0, not row 1. As such, LIMIT 1 OFFSET 1 will
retrieve the second row, not the first one.

In [16]:
query('''SELECT prod_name
FROM Products
LIMIT 0 OFFSET 0;''')

Empty DataFrame
Columns: [prod_name]
Index: []

In [17]:
query('''SELECT prod_name
FROM Products
LIMIT 1 OFFSET 1;''')

           prod_name
0  Bird bean bag toy

## Challenges
1. Write a SQL statement to retrieve all customer IDs (cust_id) from the Customers table.

In [18]:
query('''SELECT cust_id
FROM Customers;''')

      cust_id
0  1000000001
1  1000000002
2  1000000003
3  1000000004
4  1000000005

2. The OrderItems table contains every item ordered (and some were ordered multiple times). Write a SQL statement to retrieve a list of the products (prod_id) ordered (not every order, just a unique list of products). Here’s a
hint: you should end up with seven unique rows displayed.

In [19]:
query('''SELECT distinct prod_id
FROM OrderItems;''')

  prod_id
0  BNBG01
1  BNBG02
2  BNBG03
3    BR01
4    BR02
5    BR03
6  RGAN01

3. Write a SQL statement that retrieves all columns from the Customers table and an alternate SELECT that retrieves just the customer ID. Use comments to comment out one SELECT so as to be able to run the other. (And, of course, test both statements.)

In [20]:
query('''
SELECT cust_id 
FROM Customers;

''')

      cust_id
0  1000000001
1  1000000002
2  1000000003
3  1000000004
4  1000000005

In [21]:
query('''
SELECT *
# SELECT cust_id 
FROM Customers;

''')

,cust_id,cust_name,cust_address,cust_city,cust_state,cust_zip,cust_country,cust_contact,cust_email
0,1000000001,Village Toys,200 Maple Lane,Detroit,MI,44444,USA,John Smith,sales@villagetoys.com
1,1000000002,Kids Place,333 South Lake Drive,Columbus,OH,43333,USA,Michelle Green,None
2,1000000003,Fun4All,1 Sunny Place,Muncie,IN,42222,USA,Jim Jones,jjones@fun4all.com
3,1000000004,Fun4All,829 Riverside Drive,Phoenix,AZ,88888,USA,Denise L. Stephens,dstephens@fun4all.com
4,1000000005,The Toy Store,4545 53rd Street,Chicago,IL,54545,USA,Kim Howard,None

# Sorting Retrieved Data
##  Clause
`SQL statements are made up of clauses, some required and some optional. A
clause usually consists of a keyword and supplied data. An example of this is
the SELECT statement’s FROM clause, which you saw in the last lesson.`

In [22]:
query('''
SELECT prod_name
FROM Products
ORDER BY prod_name;
''')

             prod_name
0   12 inch teddy bear
1   18 inch teddy bear
2    8 inch teddy bear
3    Bird bean bag toy
4    Fish bean bag toy
5            King doll
6           Queen doll
7  Rabbit bean bag toy
8          Raggedy Ann

### Caution: Position of ORDER BY Clause
When specifying an ORDER BY clause, be sure that it is the last clause in your
SELECT statement. If it is not the last clause, an error will be generated.

## Specifying Sort Direction
Data sorting is not limited to **`ascending sort orders`** (from A to Z). Although this is
the **`default`** sort order, the ORDER BY clause can also be used to sort in descending
order (from Z to A). To sort by descending order, you must specify the keyword
**`DESC`**.


## Sorting by Multiple Columns

In [23]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
ORDER BY prod_price desc, prod_name ;

''')

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL01        9.49            King doll
2   RYL02        9.49           Queen doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG02        3.49    Bird bean bag toy
7  BNBG01        3.49    Fish bean bag toy
8  BNBG03        3.49  Rabbit bean bag toy

## Sorting by Column Position
In addition to being able to specify sort order using column names, ORDER BY
also supports ordering specified by relative column position. The best way to
understand this is to look at an example:

In [24]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
ORDER BY 2 desc, 3 ;

''')

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL01        9.49            King doll
2   RYL02        9.49           Queen doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG02        3.49    Bird bean bag toy
7  BNBG01        3.49    Fish bean bag toy
8  BNBG03        3.49  Rabbit bean bag toy

###  Case Sensitivity and Sort Orders

When you are sorting textual data, is `A` the same as `a`? And does `a` come
before `B` or after `Z`? These are not theoretical questions, and the answers
depend on how the database is set up.


In dictionary sort order, A is treated the same as a, and that is the default
behavior for most DBMSs. However, most good DBMSs enable database
administrators to change this behavior if needed. (If your database contains
lots of foreign language characters, this might become necessary.)


The key here is that, if you do need an alternate sort order, you may not be
able to accomplish this with a simple ORDER BY clause.

### Write a SQL statement 
to retrieve all customer names (cust_names) from the
Customers table, and display the results sorted from Z to A

In [25]:
query('''
SELECT cust_name
FROM Customers
order by 1 desc ;

''')

       cust_name
0   Village Toys
1  The Toy Store
2     Kids Place
3        Fun4All
4        Fun4All

# Filtering Data
## Using the WHERE Clause
Database tables usually contain large amounts of data, and you seldom need to
retrieve all the rows in a table. More often than not you’ll want to extract a subset
of the table’s data as needed for specific operations or reports. Retrieving just the
data you want involves specifying search criteria, also known as a filter
condition.

In [26]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price < 4;

''')

             prod_name  prod_price
0    Fish bean bag toy        3.49
1    Bird bean bag toy        3.49
2  Rabbit bean bag toy        3.49

### Caution: WHERE Clause Position
When using both ORDER BY and WHERE clauses, make sure that ORDER BY comes
after the WHERE. Otherwise, an error will be generated.


|Operator| Description|
|--------|------------|
| = | Equality|
| <> | Nonequality|
| !=  | Nonequality|
| <  | Less than|
|<= | Less than or equal to|
|!< | Not less than|
| > | Greater than|
| >= | Greater than or equal to |
| !>  | Not greater than |
| BETWEEN | Between two specified values |
| IS NULL | Is a NULL value |

### When to Use Quotes
If you look closely at the conditions used in the above WHERE clauses, you will
notice that some values are enclosed within single quotes, and others are not.
The single quotes are used to delimit a string. If you are comparing a value
against a column that is a string datatype, the delimiting quotes are required.
Quotes are not used to delimit values used with numeric columns.

In [27]:
query('''
SELECT vend_id, prod_name
FROM Products
WHERE vend_id <> 'DLL01';

''')

  vend_id           prod_name
0   BRS01   8 inch teddy bear
1   BRS01  12 inch teddy bear
2   BRS01  18 inch teddy bear
3   FNG01           King doll
4   FNG01          Queen doll

###  != or <>?
Usually, you can use != and <> interchangeably. However, not all DBMSs
support both forms of the nonequality operator. If in doubt, consult your
DBMS documentation.

In [28]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price <> 3.49 AND prod_price <>  9.49;

''')

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2  18 inch teddy bear       11.99
3         Raggedy Ann        4.99

## Checking for a Range of Values
To check for a range of values, you can use the BETWEEN operator. Its syntax is a
little different from other WHERE clause operators because it requires two values:
the beginning and end of the range. The BETWEEN operator can be used, for
example, to check for all products that cost between $5 and $10 or for all dates
that fall between specified start and end dates.

In [29]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price between 4 and 10;

''')

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2         Raggedy Ann        4.99
3           King doll        9.49
4          Queen doll        9.49

## Checking for No Value
When a table is created, the table designer can specify whether or not individual
columns can contain no value. When a column contains no value, it is said to
contain a NULL value.

`No value, as opposed to a field containing 0, or an empty string, or just spaces`

In [30]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price BETWEEN 5 AND 10;

''')

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2           King doll        9.49
3          Queen doll        9.49

In [31]:
query('''
SELECT cust_name , cust_email
FROM Customers
''')

       cust_name             cust_email
0   Village Toys  sales@villagetoys.com
1     Kids Place                   None
2        Fun4All     jjones@fun4all.com
3        Fun4All  dstephens@fun4all.com
4  The Toy Store                   None

### Caution: NULL and Nonmatches
You might expect that when you filter to select all rows that do not have a
particular value, rows with a `NULL` will be returned. But they will not. `NULL` is
strange this way, and rows with `NULL` in the filter column are not returned
when filtering for matches or when filtering for nonmatches.

In [32]:
query('''
SELECT cust_name
FROM Customers
WHERE cust_email IS NULL;
''')

       cust_name
0     Kids Place
1  The Toy Store

# Advanced Data Filtering

## Operator
A special keyword used to join or change clauses within a WHERE clause. Also
known as logical operators.
## AND
A keyword used in a WHERE clause to specify that only rows matching all the
specified conditions should be retrieved.
### Note: No ORDER BY Clause Specified
`In the interests of saving space (and your typing), I omitted the ORDER BY clause in many of these examples. As such, it is entirely possible that your output won’t exactly match the output in the book. While the number ofreturned rows should always match, their order may not. Of course, feel free to add an ORDER BY clause if you’d like; it needs to go after the WHERE clause.`
## OR
A keyword used in a WHERE clause to specify that any rows matching either of
the specified conditions should be retrieved.

In [33]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
WHERE vend_id = 'DLL01' AND prod_price <= 4;

''')

  prod_id  prod_price            prod_name
0  BNBG01        3.49    Fish bean bag toy
1  BNBG02        3.49    Bird bean bag toy
2  BNBG03        3.49  Rabbit bean bag toy

In [34]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01';
''')

  prod_id  prod_price            prod_name
0    BR01        5.99    8 inch teddy bear
1    BR02        8.99   12 inch teddy bear
2    BR03       11.99   18 inch teddy bear
3  BNBG01        3.49    Fish bean bag toy
4  BNBG02        3.49    Bird bean bag toy
5  BNBG03        3.49  Rabbit bean bag toy
6  RGAN01        4.99          Raggedy Ann

In [35]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01'
AND prod_price >= 10;

''')

             prod_name  prod_price
0   18 inch teddy bear       11.99
1    Fish bean bag toy        3.49
2    Bird bean bag toy        3.49
3  Rabbit bean bag toy        3.49
4          Raggedy Ann        4.99

In [36]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE (vend_id = 'DLL01' OR vend_id = 'BRS01')
AND prod_price >= 10;

''')

            prod_name  prod_price
0  18 inch teddy bear       11.99

### Tip: Using Parentheses in WHERE Clauses
Whenever you write WHERE clauses that use both AND and OR operators, use
parentheses to explicitly group operators. Don’t ever rely on the default
evaluation order, even if it is exactly what you want. There is no downside to
using parentheses, and you are always better off eliminating any ambiguity

In [37]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE vend_id IN ('DLL01','BRS01')
ORDER BY prod_name;

''')

             prod_name  prod_price
0   12 inch teddy bear        8.99
1   18 inch teddy bear       11.99
2    8 inch teddy bear        5.99
3    Bird bean bag toy        3.49
4    Fish bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

In [38]:
query('''SELECT prod_name, prod_price
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01'
ORDER BY prod_name;''')

             prod_name  prod_price
0   12 inch teddy bear        8.99
1   18 inch teddy bear       11.99
2    8 inch teddy bear        5.99
3    Bird bean bag toy        3.49
4    Fish bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

## IN
A keyword used in a WHERE clause to specify a list of values to be matched
using an OR comparison.

## NOT
A keyword used in a WHERE clause to negate a condition.

In [39]:
query('''
SELECT prod_name , vend_id
FROM Products
WHERE NOT vend_id = 'DLL01'
ORDER BY prod_name;
''')

            prod_name vend_id
0  12 inch teddy bear   BRS01
1  18 inch teddy bear   BRS01
2   8 inch teddy bear   BRS01
3           King doll   FNG01
4          Queen doll   FNG01

In [40]:


query('''
SELECT prod_name , vend_id
FROM Products
WHERE NOT vend_id IN ('DLL01','BRS01')
ORDER BY prod_name;
''')

    prod_name vend_id
0   King doll   FNG01
1  Queen doll   FNG01

In [41]:
query('''
SELECT prod_name
FROM Products
WHERE vend_id <> 'DLL01'
ORDER BY prod_name;

''')

            prod_name
0  12 inch teddy bear
1  18 inch teddy bear
2   8 inch teddy bear
3           King doll
4          Queen doll

# Using Wildcard Filtering
## Wildcards
Special characters used to match parts of a value.
## Search pattern
A search condition made up of literal text, wildcard characters, or any
combination of the above.
## Predicate
When is an operator not an operator? When it is a “predicate.” Technically,
LIKE is a predicate, not an operator. The end result is the same. Just be aware
of this term in case you run across it in SQL documentation or manuals.
## The Percent Sign (%) Wildcard
The most frequently used wildcard is the percent sign (%). Within a search string,
% means match any number of occurrences of any character.Wildcards can be used anywhere within the search pattern, and multiple wildcards may be used as well.
### Note: Case Sensitivity
Depending on our DBMS and how it is configured, searches may be case
sensitive, in which case 'fish%' would not match Fish bean bag toy.
### Tip: Searching for Partial Email Addresses
There is one situation in which wildcards may indeed be useful in the middle
of a search pattern, and that is looking for email addresses based on a partial
address, such as WHERE email 'LIKE b%@forta.com'.
### Note: Watch for Trailing Spaces
Some DBMSs pad field contents with spaces. For example, if a column
expects 50 characters and the text stored is Fish bean bag toy (17
characters), 33 spaces may be appended to the text so as to fully fill the
column. This padding usually has no real impact on data and how it is used,
but it could negatively affect the just-used SQL statement. The clause WHERE
prod_name LIKE 'F%y' will only match prod_namethen it will not end with if
it starts with F and ends with y, and if the value is padded with spaces, then it
will not end with y and so Fish bean bag toy will not be retrieved. One
simple solution to this problem is to append a second % to the search pattern.
'F%y%' will also match characters (or spaces) after the y.
### Caution: Watch for NULL
It may seem that the % wildcard matches anything, but there is one exception:
NULL. Not even the clause WHERE prod_name LIKE '%' will match a row with
the value NULL as the product name.

In [42]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '%bean bag%';
''')

  prod_id            prod_name
0  BNBG01    Fish bean bag toy
1  BNBG02    Bird bean bag toy
2  BNBG03  Rabbit bean bag toy

In [43]:
query('''
SELECT prod_name
FROM Products
WHERE prod_name LIKE 'F%y%';
''')

           prod_name
0  Fish bean bag toy

## The Underscore (_) Wildcard
The underscore is used just like %,
but instead of matching multiple characters, the underscore matches just a single
character.

### Note: Watch for Trailing Spaces
As in the previous example, you may have to append a wildcard to the pattern
for this example to work.

In [44]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '__ inch teddy bear';
''')

  prod_id           prod_name
0    BR02  12 inch teddy bear
1    BR03  18 inch teddy bear

In [45]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '% inch teddy bear';
''')

  prod_id           prod_name
0    BR01   8 inch teddy bear
1    BR02  12 inch teddy bear
2    BR03  18 inch teddy bear

## The Brackets ([]) Wildcard
The brackets ([]) wildcard is used to specify a set of characters, any one of
which must match a character in the specified position (the location of the
wildcard).

### Note: Sets Are Not Commonly Supported
Unlike the wildcards described thus far, the use of [] to create sets is not
supported by all DBMSs. Sets are supported in Microsoft SQL Server, but
are not supported in MySQL, Oracle, DB2, and SQLite. Consult your DBMS
documentation to determine if sets are supported.

In [46]:
query('''

SELECT cust_contact
FROM Customers
WHERE cust_contact LIKE '[JM]%'
ORDER BY cust_contact;

''')

Empty DataFrame
Columns: [cust_contact]
Index: []

## Tips for Using Wildcards

- Don’t overuse wildcards. If another search operator will do, use it instead.

- When you do use wildcards, try not to use them at the beginning of the search pattern unless absolutely necessary. Search patterns that begin with wildcards are the slowest to process.

- Pay careful attention to the placement of the wildcard symbols. If they are misplaced, you might not return the data you intended.

# Creating Calculated Fields

Data stored within a database’s tables is often not available in the exact format
needed by your applications. Here are some examples:
- You need to display a field containing the name of a company along with the company’s location, but that information is stored in separate table columns.
- City, state, and ZIP codes are stored in separate columns (as they should be), but your mailing label printing program needs them retrieved as one correctly formatted field.
- Column data is in mixed upper- and lowercase, and your report needs all data presented in uppercase.
- An OrderItems table stores item price and quantity, but not the expanded price (price multiplied by quantity) of each item. To print invoices, you need that expanded price.
- You need total, averages, or other calculations based on table data.

## Field

Essentially means the same thing as column and often used interchangeably,
although database columns are typically called columns and the term fields is
usually used in conjunction with calculated fields.

## Concatenate

Joining values together (by appending them to each other) to form a single
long value.

### Caution: Alias Names

Aliases may be single words or complete strings. If the latter is used, then the
string should be enclosed within quotes. This practice is legal but is stronglydiscouraged. While multiword names are indeed highly readable, they create
all sorts of problems for many client applications—so much so that one of the
most common uses of aliases is to rename multiword column names to singleword names (as explained above).

Aliases are also sometimes referred to as derived columns, so regardless of
the term you run across, they mean the same thing.

In [47]:
query('''
SELECT Concat(vend_name,' , ' , vend_country) as concat
FROM Vendors
ORDER BY vend_name;
''')

                    concat
0      Bear Emporium , USA
1         Bears R Us , USA
2    Doll House Inc. , USA
3  Fun and Games , England
4       Furball Inc. , USA
5  Jouets et ours , France

In [48]:
query('''
SELECT Concat(vend_name, ' (', vend_country, ')') as concat
FROM Vendors
ORDER BY vend_name;
''')

                    concat
0      Bear Emporium (USA)
1         Bears R Us (USA)
2    Doll House Inc. (USA)
3  Fun and Games (England)
4       Furball Inc. (USA)
5  Jouets et ours (France)

### The CONCAT() function 
adds two or more expressions together.

Note: Also look at the CONCAT_WS() function.

#### Syntax
`CONCAT(expression1, expression2, expression3,...)`

- The name stored in the vend_name column
- A string containing a space and an open parenthesisThe country stored in the vend_country column
- A string containing the close parenthesis

## Performing Mathematical Calculations

In [49]:
query('''
SELECT prod_id, quantity, item_price, 

quantity * item_price AS expanded_price ,

quantity * item_price  * 0.03 AS Profit_3_per_cent

FROM OrderItems
WHERE order_num = 20008;
''')

  prod_id  quantity  item_price  expanded_price  Profit_3_per_cent
0  RGAN01         5        4.99           24.95             0.7485
1    BR03         5       11.99           59.95             1.7985
2  BNBG01        10        3.49           34.90             1.0470
3  BNBG02        10        3.49           34.90             1.0470
4  BNBG03        10        3.49           34.90             1.0470

## SQL Mathematical Operators

| Operator | Description |
|--------|------------|
| + | Addition|
| - | Subtraction |
| * | Multiplication |
| / | Division |

# Using Data Manipulation Functions


| Function | Syntax |
|--------|------------|
| Extract part of a string |  DB2, Oracle, PostgreSQL, and SQLite use SUBSTR(). MariaDB, MySQL, and SQL Server use SUBSTRING(). | 
| Datatype conversion |  Oracle uses multiple functions, one for each conversion type. DB2, PostgreSQL, and SQL Server use CAST(). MariaDB, MySQL, and SQL Server use CONVERT(). | 
| Get current date | DB2 and PostgreSQL use CURRENT_DATE. MariaDB and MySQL use CURDATE(). Oracle uses SYSDATE. SQL Server uses GETDATE(). SQLite uses DATE(). | 


## Using Functions
**Most SQL implementations support the following types of functions:**
* Text functions are used to manipulate strings of text (for example, trimming or padding values and converting values to upper- and lowercase).
* Numeric functions are used to perform mathematical operations on numeric data (for example, returning absolute numbers and performing algebraic calculations).
* Date and time functions are used to manipulate date and time values and to extract specific components from these values (for example, returning differences between dates and checking date validity).
*  Formatting functions are used to generate user-friendly outputs (for example, displaying dates in local languages and formats, or currencies with the right symbols and comma placement).
*  System functions return information specific to the DBMS being used (for example, returning user login information).


## Text Manipulation Functions
### Tip: UPPERCASE, lowercase, MixedCase
As should be clear by now, SQL functions are not case sensitive, so you can
use upper(), UPPER(), Upper(), or substr(), SUBSTR(), SubStr(), and so on.
Case is a user preference, so do as you choose, but be consistent and don’t
keep changing styles in your code; it makes the SQL really hard to read.


| Function | Description |
|--------|------------|
| LEFT() (or use substring function | Returns characters from left of string |
| LENGTH() (also DATALENGTH() orLEN()) | Returns the length of a string |
| LOWER() | Converts string to lowercase |
| LTRIM() | Trims white space from left of string |
| RIGHT() (or use substring function) | Returns characters from right of string |
| RTRIM() Trims white space from right of string |
| SUBSTR() or SUBSTRING() | Extracts part of a string |
| SOUNDEX() | Returns a string’s SOUNDEX value |
| UPPER() | Converts string to uppercas |


## Date and Time Manipulation Functions
Date and times are stored in tables using datatypes, and each DBMS uses its own
special varieties. date and time functions are almost always used to read,
expand, and manipulate these values

## Numeric Manipulation Functions
These functions tend to be used primarily for algebraic, trigonometric, or geometric
calculations and, therefore, are not as frequently used as string or date and time
manipulation functions.

| Function | Description |
|--------|------------|
| ABS() | Returns a number’s absolute value |
| COS() | Returns the trigonometric cosine of a specified angle |
| EXP() | Returns the exponential value of a specific numberPI() Returns the value of PI |
| SIN() | Returns the trigonometric sine of a specified angle |
| SQRT() | Returns the square root of a specified number |
| TAN() | Returns the trigonometric tangent of a specified angle |

In [50]:
query('''
SELECT cust_name , length(cust_name)  , LOWER(cust_name) , 
LTRIM(cust_name) , 
RTRIM(cust_name) , 
SOUNDEX(cust_name) , 
RTRIM(cust_name) , 
UPPER(cust_name)
FROM teach_yourself_sql.customers;

''')

,cust_name,length(cust_name),LOWER(cust_name),LTRIM(cust_name),RTRIM(cust_name),SOUNDEX(cust_name),RTRIM(cust_name),UPPER(cust_name)
0,Village Toys,12,village toys,Village Toys,Village Toys,V4232,Village Toys,VILLAGE TOYS
1,Kids Place,10,kids place,Kids Place,Kids Place,K32142,Kids Place,KIDS PLACE
2,Fun4All,7,fun4all,Fun4All,Fun4All,F540,Fun4All,FUN4ALL
3,Fun4All,7,fun4all,Fun4All,Fun4All,F540,Fun4All,FUN4ALL
4,The Toy Store,13,the toy store,The Toy Store,The Toy Store,T236,The Toy Store,THE TOY STORE

In [53]:
query('''
SELECT prod_price , 
ABS(prod_price) , 
COS(prod_price) , 
EXP(prod_price) , 
SIN(prod_price) , 
SQRT(prod_price) , 
TAN(prod_price)
FROM teach_yourself_sql.Products;
''')

,prod_price,ABS(prod_price),COS(prod_price),EXP(prod_price),SIN(prod_price),SQRT(prod_price),TAN(prod_price)
0,3.49,3.49,-0.939918,32.785948,-0.341401,1.868154,0.363225
1,3.49,3.49,-0.939918,32.785948,-0.341401,1.868154,0.363225
2,3.49,3.49,-0.939918,32.785948,-0.341401,1.868154,0.363225
3,5.99,5.99,0.957328,399.414610,-0.289003,2.447448,-0.301885
4,8.99,8.99,-0.906964,8022.456895,0.421209,2.998333,-0.464417
5,11.99,11.99,0.838446,161135.354186,-0.544984,3.462658,-0.649993
6,4.99,4.99,0.274059,146.936423,-0.961713,2.233831,-3.509147
7,9.49,9.49,-0.997874,13226.795327,-0.065176,3.080584,0.065315
8,9.49,9.49,-0.997874,13226.795327,-0.065176,3.080584,0.065315

In [51]:
query('''
SELECT vend_name, UPPER(vend_name) AS vend_name_upcase , LOWER(vend_name) AS vend_name_lowcase
FROM Vendors
ORDER BY vend_name;
''')

         vend_name vend_name_upcase vend_name_lowcase
0    Bear Emporium    BEAR EMPORIUM     bear emporium
1       Bears R Us       BEARS R US        bears r us
2  Doll House Inc.  DOLL HOUSE INC.   doll house inc.
3    Fun and Games    FUN AND GAMES     fun and games
4     Furball Inc.     FURBALL INC.      furball inc.
5   Jouets et ours   JOUETS ET OURS    jouets et ours

In [71]:
query('''
SELECT order_date , YEAR(order_date) as YEAR , order_num 
FROM Orders 
WHERE YEAR(order_date) = 2020;
''')

  order_date  YEAR  order_num
0 2020-05-01  2020      20005
1 2020-01-12  2020      20006
2 2020-01-30  2020      20007
3 2020-02-03  2020      20008
4 2020-02-08  2020      20009

# Summarizing Data
## Using Aggregate Functions
It is often necessary to summarize data without actually retrieving it all, and SQL
provides special functions for this purpose. Using these functions, SQL queries
are often used to retrieve data for analysis and reporting purposes. Examples of
this type of retrieval are
* Determining the number of rows in a table (or the number of rows that meet some condition or contain a specific value)
* Obtaining the sum of a set of rows in a table
* Finding the highest, lowest, and average values in a table column (either for all rows or for specific rows)

## Aggregate Functions
Functions that operate on a set of rows to calculate and return a single value.

| Function | Description |
|--------|------------|
| AVG() | Returns a column’s average value |
| COUNT() | Returns the number of rows in a column |
| MAX() | Returns a column’s highest value |
| MIN() | Returns a column’s lowest value |
| SUM() | Returns the sum of a column’s values |

### Caution: Individual Columns Only
AVG() may only be used to determine the average of a specific numeric
column, and that column name must be specified as the function parameter. To
obtain the average value of multiple columns, you must use multiple AVG()
functions. The exception to this is when returning a single value that iscalculated from multiple columns, as will be explained later in this lesson.
### Note: NULL Values
Column rows containing NULL values are ignored by the AVG() function.

## The count values
1. Use COUNT(*) to count the number of rows in a table, whether columns contain values or NULL values.
2. Use COUNT(column) to count the number of rows that have values in a specific column, ignoring NULL values.

**Column rows with NULL values in them are ignored by the COUNT() function if a column name is specified, but not if the asterisk (*) is used.**

### Tip: Using MAX() with Nonnumeric Data
Although MAX() is usually used to find the highest numeric or date values,
many (but not all) DBMSs allow it to be used to return the highest value in
any columns including textual columns. When used with textual data, MAX()
returns the row that would be the last if the data were sorted by that column.
### Note: NULL Values
Column rows with NULL values in them are ignored by the MAX() function

### Tip: Using MIN() with Nonnumeric Data
Although MIN() is usually used to find the lowest numeric or date values,
many (but not all) DBMSs allow it to be used to return the lowest value in
any columns including textual columns. When used with textual data, MIN()
will return the row that would be first if the data were sorted by that column.

### Note: NULL Values
Column rows with NULL values in them are ignored by the MIN() function.

In [72]:
query('''
SELECT AVG(prod_price) AS avg_price , 

COUNT(*) AS num_prod_price , 

COUNT(prod_price) AS num_prod_price ,

MAX(prod_price) AS max_price ,

MIN(prod_price) AS min_price , 

SUM(prod_price) AS items_ordered
FROM Products;
''')

,avg_price,num_prod_price,num_prod_price,max_price,min_price,items_ordered
0,6.823333,9,9,11.99,3.49,61.41

In [73]:
query(''' SELECT SUM( item_price * quantity) AS total_price
FROM OrderItems
WHERE order_num = 20005;
''')

   total_price
0       1648.0

### Tip: Performing Calculations on Multiple Columns
All the aggregate functions can be used to perform calculations on multiple
columns using the standard mathematical operators, as shown in the example.
### Note: NULL Values
Column rows with NULL values in them are ignored by the SUM() function
## Aggregates on Distinct Values
1. To perform calculations on all rows, specify the ALL argument or specify no argument at all (because ALL is the default behavior).
2. To include only unique values, specify the DISTINCT argument.

### Tip: ALL Is Default
The ALL argument need not be specified because it is the default behavior. If
DISTINCT is not specified, ALL is assumed.

### Caution: No DISTINCT with COUNT(*)
DISTINCT may only be used with COUNT() if a column name is specified.
DISTINCT may not be used with COUNT(*). Similarly, DISTINCT must be used
with a column name and not with a calculation or expression.
### Tip: Using DISTINCT with MIN() and MAX()
Although DISTINCT can technically be used with MIN() and MAX(), there is
actually no value in doing so. The minimum and maximum values in a column
will be the same whether or not only distinct values are included.

### Note: Additional Aggregate Arguments
In addition to the DISTINCT and ALL arguments shown here, some DBMSs
support additional arguments such as TOP and TOP PERCENT that let you
perform calculations on subsets of query results. Refer to your DBMS
documentation to determine exactly what arguments are available to you.

### Caution: Naming Aliases
When specifying alias names to contain the results of an aggregate function,
try to not use the name of an actual column in the table. Although there is
nothing actually illegal about doing so, many SQL implementations do not
support this and will generate obscure error messages if you do so.

In [74]:
query('''
SELECT *
FROM Products
WHERE vend_id = 'DLL01';

''')

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
1,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"
2,BNBG03,DLL01,Rabbit bean bag toy,3.49,"Rabbit bean bag toy, comes with bean bag carrots"
3,RGAN01,DLL01,Raggedy Ann,4.99,18 inch Raggedy Ann doll

In [49]:
query('''
SELECT AVG( prod_price) AS avg_price
FROM Products
WHERE vend_id = 'DLL01';

''')

###

   avg_price
0      3.865

In [50]:
query('''
SELECT AVG(DISTINCT prod_price) AS avg_price
FROM Products
WHERE vend_id = 'DLL01';

''')

   avg_price
0       4.24

# Grouping Data
**Groups are created using the GROUP BY clause in your SELECT statement.**

1. GROUP BY clauses can contain as many columns as you want. This enables you to nest groups, providing you with more granular control over how data is grouped.
2. If you have nested groups in your GROUP BY clause, data is summarized at the last specified group. In other words, all the columns specified are evaluated together when grouping is established (so you won’t get data back for each individual column level).
3. Every column listed in GROUP BY must be a retrieved column or a valid expression (but not an aggregate function). If an expression is used in theSELECT, that same expression must be specified in GROUP BY. Aliases cannot be used.
4. Most SQL implementations do not allow GROUP BY columns with variablelength datatypes (such as text or memo fields).
5. Aside from the aggregate calculation statements, every column in your SELECT statement must be present in the GROUP BY clause.
6. If the grouping column contains a row with a NULL value, NULL will be returned as a group. If there are multiple rows with NULL values, they’ll all be grouped together. 

7. The GROUP BY clause must come after any WHERE clause and before any ORDER BY clause.

```sql
SELECT column1, function_name(column2)
FROM table_name
WHERE condition
GROUP BY column1, column2
ORDER BY column1, column2;
```

function_name: Name of the function used for example, SUM() , AVG().

table_name: Name of the table.

condition: Condition used.




## Filtering Groups
In addition to being able to group data using GROUP BY, SQL also allows you to
filter which groups to include and which to exclude. For example, you might want
a list of all customers who have made at least two orders. To obtain this data, you
must filter based on the complete group, not on individual rows.

### Tip: The ALL Clause
Some SQL implementations (such as Microsoft SQL Server) support an
optional ALL clause within GROUP BY. This clause can be used to return all
groups, even those that have no matching rows (in which case the aggregate
would return NULL). Refer to your DBMS documentation to see if it supports
ALL.
### Caution: Specifying Columns by Relative Position
Some SQL implementations allow you to specify GROUP BY columns by the
position in the SELECT list. For example, GROUP BY 2,1 can mean group by the
second column selected and then by the first. Although this shorthand syntax
is convenient, it is not supported by all SQL implementations. Its use is also
risky in that it is highly susceptible to the introduction of errors when editing
SQL statements.

### Tip: HAVING Supports All WHERE’s Operators
In Lesson  “Advanced Data Filtering,” you learned about
WHERE clause conditions (including wildcard conditions and clauses with
multiple operators). All the techniques and options that you’ve learned about
WHERE can be applied to HAVING. The syntax is identical; just the keyword is
different.

In [79]:
query('''
SELECT vend_id, COUNT(*) AS num_prods
FROM Products


''')

  vend_id  num_prods
0   BRS01          9

In [78]:
query('''
SELECT vend_id, COUNT(*) AS num_prods
FROM Products
GROUP BY vend_id;

''')

  vend_id  num_prods
0   BRS01          3
1   DLL01          4
2   FNG01          2

![](./i/sql-count-group-by1.png)

### Note: The Difference Between HAVING and WHERE
Here’s another way to look it: WHERE filters before data is grouped, and
HAVING filters after data is grouped. This is an important distinction; rows that
are eliminated by a WHERE clause will not be included in the group. This could
change the calculated values, which in turn could affect which groups are
filtered based on the use of those values in the HAVING clause.

### Note: Using HAVING and WHERE
HAVING is so similar to WHERE that most DBMSs treat them as the same thing if
no GROUP BY is specified. Nevertheless, you should make that distinction
yourself. Use HAVING only in conjunction with GROUP BY clauses. Use WHERE
for standard row-level filtering.

| ORDER BY | GROUP BY |
|--------|------------|
| Sorts generated output. | Groups rows. The output might not be in group order, however. |
| Any columns (even columns not selected) may be used. | Only selected columns or expressions columns may be used, and every selected column expression must be used. |
| Never required. | Required if using columns (or expressions) withaggregate functions. |

### Tip: Don’t Forget ORDER BY
As a rule, anytime you use a GROUP BY clause, you should also specify an
ORDER BY clause. That is the only way to ensure that data will be sorted
properly. Never rely on GROUP BY to sort your data.

In [52]:
query('''
SELECT cust_id, COUNT(*) AS orders
FROM Orders
GROUP BY cust_id
HAVING COUNT(*) >= 2;
''')

      cust_id  orders
0  1000000001       2

In [53]:
query('''
SELECT vend_id, COUNT(*) AS num_prods
FROM Products
GROUP BY vend_id
HAVING COUNT(*) > 2;
''')

  vend_id  num_prods
0   BRS01          3
1   DLL01          4

In [54]:
query('''
SELECT order_num, COUNT(*) AS items
FROM OrderItems
GROUP BY order_num
HAVING COUNT(*) >= 3
ORDER BY items, order_num;
''')

   order_num  items
0      20006      3
1      20009      3
2      20007      5
3      20008      5

## SELECT Clause Ordering
| Clause | Description | Required |
|--------|-------------|----------|
| SELECT | **Columns or expressions to be returned** | **Yes** |
| FROM | **Table to retrieve data from** | **Only if selecting data from a table** |
| WHERE | **Row-level filtering** | **No** |
| GROUP BY | **Group specification** | **Only if calculating aggregates by group** |
| HAVING | **Group-level filtering** | **No** |
| ORDER BY | **Output sort order** | **No** |

# Working with Subqueries
## Query
Any SQL statement. However, the term is usually used to refer to SELECT
statements.

![](./i/sql-subqueries_.gif)

In [55]:
query('''
SELECT cust_id , order_num
FROM Orders
WHERE order_num 
''')

      cust_id  order_num
0  1000000001      20005
1  1000000001      20009
2  1000000003      20006
3  1000000004      20007
4  1000000005      20008

In [56]:
query('''
SELECT order_num
FROM OrderItems
WHERE prod_id = 'RGAN01'
''')

   order_num
0      20007
1      20008

In [57]:
query('''
SELECT cust_id
FROM Orders
WHERE order_num IN (20007 , 20008)
''')

      cust_id
0  1000000004
1  1000000005

In [58]:
query('''
SELECT cust_id
FROM Orders
WHERE order_num IN (SELECT order_num
                        FROM OrderItems
                        WHERE prod_id = 'RGAN01')
''')

      cust_id
0  1000000004
1  1000000005

In [59]:
query('''
SELECT cust_name, cust_contact
FROM Customers
WHERE cust_id IN (1000000004,1000000005);
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

on nasted query and subqueries, the top-level query actually returned the desired data.
### Caution: Single Column Only
Subquery SELECT statements can only retrieve a single column. Attempting to
retrieve multiple columns will return an error.
### Caution: Subqueries and Performance
The code shown here works, and it achieves the desired result. However,
using subqueries is not always the most efficient way to perform this type of
data retrieval.

In [60]:
query('''
SELECT cust_name, cust_contact
FROM Customers
WHERE cust_id IN (SELECT cust_id
FROM Orders
WHERE order_num IN (SELECT order_num
FROM OrderItems
WHERE prod_id = 'RGAN01'));
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

## Using Subqueries as Calculated Fields
Suppose you
wanted to display the total number of orders placed by every customer in your
Customers table. Orders are stored in the Orders table along with the appropriate
customer ID.
To perform this operation, follow these steps:
1. Retrieve the list of customers from the Customers table.
2. For each customer retrieved, count the number of associated orders in the Orders table.

In [61]:
query('''
SELECT COUNT(*) AS orders FROM Orders
WHERE cust_id = 1000000001;
''')

   orders
0       2

In [62]:
query('''
SELECT cust_name,
cust_state,
(SELECT COUNT(*)
FROM Orders
WHERE Orders.cust_id = Customers.cust_id) AS orders
FROM Customers
ORDER BY cust_name;
''')

       cust_name cust_state  orders
0        Fun4All         IN       1
1        Fun4All         AZ       1
2     Kids Place         OH       0
3  The Toy Store         IL       1
4   Village Toys         MI       2

In [63]:
query('''
SELECT cust_name,
cust_state,
(SELECT COUNT(*)
FROM Orders
WHERE cust_id = cust_id) AS orders
FROM Customers
ORDER BY cust_name;
''')

       cust_name cust_state  orders
0        Fun4All         IN       5
1        Fun4All         AZ       5
2     Kids Place         OH       5
3  The Toy Store         IL       5
4   Village Toys         MI       5

### Caution: Fully Qualified Column Names
You just saw a very important reason to use fully qualified column names.
Without the extra specificity, the wrong results were returned because the
DBMS misunderstood what you intended. Sometimes the ambiguity caused by
the presence of conflicting column names will actually cause the DBMS to
throw an error. For example, this might occur if your WHERE or ORDER BY
clause specified a column name that was present in multiple tables. A good
rule is that if you are ever working with more than one table in a SELECT
statement, then use fully qualified column names to avoid any and all
ambiguity.
### Tip: Subqueries May Not Always Be the Best Option
As explained earlier in this lesson, although the sample code shown here
works, it is often not the most efficient way to perform this type of data
retrieval. You will revisit this example when you learn about JOINs in the
next two lessons.

# Joining Tables
-> Suppose you had a database table containing a product list, with each product in
its own row. The kind of information you would store with each product would
include a description and price, along with vendor information about the company
that creates the product.
Now suppose that you had multiple products created by the same vendor. Where
would you store the vendor information (things like vendor name, address, and
contact information)? You wouldn’t want to store that data along with the
products for several reasons:

1. Because the vendor information is the same for each product that vendor produces, repeating the information for each product is a waste of time and
storage space.
2. If vendor information changes (for example, if the vendor moves or the contact info changes), you would need to update every occurrence of the
vendor information.
3. When data is repeated (that is, the vendor information is used with each product), there is a high likelihood that the data will not be entered identically each time. Inconsistent data is extremely difficult to use in reporting

## Scale
Able to handle an increasing load without failing. A well-designed database
or application is said to scale well.
## Why Use Joins?
#### Using Interactive DBMS Tools
Understand that a join is not a physical entity; in other words, it does not exist
in the actual database tables. A join is created by the DBMS as needed, and it
persists for the duration of the query execution.

Many DBMSs provide graphical interfaces that can be used to define table
relationships interactively. These tools can be invaluable in helping to
maintain referential integrity. When you are using relational tables, it is
important that only valid data is inserted into relational columns. Going back
to the example, if an invalid vendor ID is stored in the Products table, those
products would be inaccessible because they would not be related to any
vendor. To prevent this from occurring, you can instruct the database to only
allow valid values (ones present in the Vendors table) in the vendor ID
column in the Products table. Referential integrity means that the DBMS
enforces data integrity rules. And these rules are often managed throughDBMS provided interfaces.

## Caution: Fully Qualifying Column Names
As noted in the previous lesson, you must use the fully qualified column name
(table and column separated by a period) whenever there is a possible
ambiguity about which column you are referring to. Most DBMSs will return
an error message if you refer to an ambiguous column name without fully
qualifying it with a table name.

**When you join two tables, what you are actually doing is pairing every row in the first table with every row in the second table.**

The WHERE clause acts as a filter to only include rows that match the specified
filter condition—the join condition, in this case. Without the WHERE clause, every
row in the first table will be paired with every row in the second table,
regardless of whether they logically go together or not.

## Cartesian Product
The results returned by a table relationship without a join condition. The
number of rows retrieved will be the number of rows in the first table
multiplied by the number of rows in the second table.

### Caution: Don’t Forget the WHERE Clause
Make sure all your joins have WHERE clauses; otherwise, the DBMS will
return far more data than you want. Similarly, make sure your WHERE clauses
are correct. An incorrect filter condition will cause the DBMS to returnincorrect data.
#### Tip: Cross Joins
Sometimes you’ll hear the type of join that returns a Cartesian Product
referred to as a cross join.

## Inner Joins
The join you have been using so far is called an equijoin—a join based on the
testing of equality between two tables.

![](./i/img_innerjoin.gif)
```sql
SELECT column_name(s)
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;

```

![](./i/img_leftjoin.gif)
```sql
SELECT column_name(s)
FROM table1
LEFT JOIN table2
ON table1.column_name = table2.column_name;
```

![](./i/img_rightjoin.gif)
```sql
SELECT column_name(s)
FROM table1
RIGHT JOIN table2
ON table1.column_name = table2.column_name;
```



![](./i/img_fulljoin.gif)
```sql
SELECT column_name(s)
FROM table1
FULL OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;
```


![](./i/db-02_2119.png)
**A self join is a regular join, but the table is joined with itself.**


```sql
SELECT column_name(s)
FROM table1 T1, table1 T2
WHERE condition;
```

### Inner joins narrow down the set of rows returns.
### Outer joins (left or right) don't change number of rows returned, but just "pick up" additional columns if possible.
### An INNER JOIN will only return the rows where there are matching values in both tables, whereas a LEFT JOIN will return ALL the rows from the LEFT table even if there is no matching row in the RIGHT table.

In [64]:
query('''
SELECT *
FROM Vendors
''')

,vend_id,vend_name,vend_address,vend_city,vend_state,vend_zip,vend_country
0,BRE02,Bear Emporium,500 Park Street,Anytown,OH,44333,USA
1,BRS01,Bears R Us,123 Main Street,Bear Town,MI,44444,USA
2,DLL01,Doll House Inc.,555 High Street,Dollsville,CA,99999,USA
3,FNG01,Fun and Games,42 Galaxy Road,London,None,N16 6PS,England
4,FRB01,Furball Inc.,1000 5th Avenue,New York,NY,11111,USA
5,JTS01,Jouets et ours,1 Rue Amusement,Paris,None,45678,France

In [65]:
query('''
SELECT  *
FROM  Products 
''')

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
1,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"
2,BNBG03,DLL01,Rabbit bean bag toy,3.49,"Rabbit bean bag toy, comes with bean bag carrots"
3,BR01,BRS01,8 inch teddy bear,5.99,"8 inch teddy bear, comes with cap and jacket"
4,BR02,BRS01,12 inch teddy bear,8.99,"12 inch teddy bear, comes with cap and jacket"
5,BR03,BRS01,18 inch teddy bear,11.99,"18 inch teddy bear, comes with cap and jacket"
6,RGAN01,DLL01,Raggedy Ann,4.99,18 inch Raggedy Ann doll
7,RYL01,FNG01,King doll,9.49,12 inch king doll with royal garments and crown
8,RYL02,FNG01,Queen doll,9.49,12 inch queen doll with royal garments and crown

In [66]:
query('''
SELECT vend_name, prod_name, prod_price
FROM Vendors                                             -- table 1
INNER JOIN Products                                      -- table 2
ON Vendors.vend_id = Products.vend_id;
''')

         vend_name            prod_name  prod_price
0  Doll House Inc.    Fish bean bag toy        3.49
1  Doll House Inc.    Bird bean bag toy        3.49
2  Doll House Inc.  Rabbit bean bag toy        3.49
3       Bears R Us    8 inch teddy bear        5.99
4       Bears R Us   12 inch teddy bear        8.99
5       Bears R Us   18 inch teddy bear       11.99
6  Doll House Inc.          Raggedy Ann        4.99
7    Fun and Games            King doll        9.49
8    Fun and Games           Queen doll        9.49

### Note: The “Right” Syntax
Per the ANSI SQL specification, use of the INNER JOIN syntax is preferred
over the simple equijoins syntax used previously. Indeed, SQL purists tend to
look upon the simple syntax with disdain. That being said, DBMSs do indeed
support both the simpler and the standard formats, so my recommendation is
that you take the time to understand both formats but use whichever you feel
more comfortable with.
## Joining Multiple Tables

### Caution: Performance Considerations
DBMSs process joins at runtime relating each table as specified. This
process can become very resource intensive, so be careful not to join tables
unnecessarily. The more tables you join, the more performance will degrade.
### Caution: Maximum Number of Tables in a Join
While it is true that SQL itself has no maximum number of tables per join
restriction, many DBMSs do indeed have restrictions. Refer to your DBMS
documentation to determine what restrictions there are, if any.

### Tip: It Pays to Experiment
As you can see, there is often more than one way to perform any given SQL
operation. And there is rarely a definitive right or wrong way. Performancecan be affected by the type of operation, the DBMS being used, the amount of
data in the tables, whether or not indexes and keys are present, and a whole
slew of other criteria. Therefore, it is often worth experimenting with
different selection mechanisms to find the one that works best for you.
#### Note: Joined Column Names
In all of the examples presented here, the columns being joined are named the
same (cust_id in both Customers and Orders, for example). Having
identically named columns is not a requirement, and you’ll often encounter
databases that use different naming conventions. I created the tables this way
to make the examples simpler and clearer.

In [67]:
query('''
SELECT prod_name, vend_name, prod_price, quantity
FROM OrderItems, Products, Vendors
WHERE Products.vend_id = Vendors.vend_id
AND OrderItems.prod_id = Products.prod_id
AND order_num = 20007;
''')

             prod_name        vend_name  prod_price  quantity
0   18 inch teddy bear       Bears R Us       11.99        50
1    Fish bean bag toy  Doll House Inc.        3.49       100
2    Bird bean bag toy  Doll House Inc.        3.49       100
3  Rabbit bean bag toy  Doll House Inc.        3.49       100
4          Raggedy Ann  Doll House Inc.        4.99        50

In [68]:
# Query with a subsquery
query('''
SELECT cust_name, cust_contact
FROM Customers
WHERE cust_id IN (SELECT cust_id
                 FROM Orders
                WHERE order_num IN (SELECT order_num
                                      FROM OrderItems
                                      WHERE prod_id = 'RGAN01'));
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

In [69]:
# Above Query with a join
query('''
SELECT cust_name, cust_contact
FROM Customers, Orders, OrderItems
WHERE Customers.cust_id = Orders.cust_id
AND OrderItems.order_num = Orders.order_num
AND prod_id = 'RGAN01';
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

# Creating Advanced Joins
using aliases for column names and calculated fields, SQL also
enables you to alias table names. There are two primary reasons to do this:
To shorten the SQL syntax
To enable multiple uses of the same table within a single SELECT statement
### Caution: No AS in Oracle
Oracle does not support the AS keyword when aliasing tables. To use aliases
in Oracle, simply specify the alias without AS (so Customers C instead of
Customers AS C).

### Tip: No AS in Oracle
Oracle users, remember to drop the AS.

In [70]:
query('''
SELECT cust_name, cust_contact
FROM Customers AS C, Orders AS O, OrderItems AS OI
WHERE C.cust_id = O.cust_id
AND OI.order_num = O.order_num
AND prod_id = 'RGAN01';
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

## Using Different Join Types
## Self Joins

Suppose you wanted to send a mailing to all the customer contacts who work for
the same company for which Jim Jones works. This query requires that you first
find out which company Jim Jones works for and next which customers work for
that company. The following is one way to approach this problem:

### Tip: Self Joins Instead of Subqueries
Self joins are often used to replace statements using subqueries that retrieve
data from the same table as the outer statement. Although the end result is the
same, many DBMSs process joins far more quickly than they do subqueries. It
is usually worth experimenting with both to determine which performs better.

## Natural Joins ▾
Whenever tables are joined, at least one column will appear in more than one
table (the columns being used to create the join). Standard joins (the inner joins
that you learned about in the last lesson) return all data, even multiple
occurrences of the same column. A natural join simply eliminates those multiple
occurrences so that only one of each column is returned.

In [71]:
query('''
SELECT cust_id, cust_name, cust_contact
FROM Customers
WHERE cust_name = (SELECT cust_name
                   FROM Customers
                   WHERE cust_contact = 'Jim Jones');
''')

      cust_id cust_name        cust_contact
0  1000000003   Fun4All           Jim Jones
1  1000000004   Fun4All  Denise L. Stephens

In [72]:
query('''
SELECT C.*, O.order_num, O.order_date, OI.prod_id, OI.quantity, OI.item_price
FROM Customers AS C, Orders AS O, OrderItems AS OI
WHERE C.cust_id = O.cust_id AND OI.order_num = O.order_num AND prod_id = 'RGAN01';
''')

,cust_id,cust_name,cust_address,cust_city,cust_state,cust_zip,cust_country,cust_contact,cust_email,order_num,order_date,prod_id,quantity,item_price
0,1000000004,Fun4All,829 Riverside Drive,Phoenix,AZ,88888,USA,Denise L. Stephens,dstephens@fun4all.com,20007,2020-01-30,RGAN01,50,4.49
1,1000000005,The Toy Store,4545 53rd Street,Chicago,IL,54545,USA,Kim Howard,None,20008,2020-02-03,RGAN01,5,4.99

In [73]:
query('''
SELECT c1.cust_id, c1.cust_name, c1.cust_contact
FROM Customers AS c1, Customers AS c2
WHERE c1.cust_name = c2.cust_name AND c2.cust_contact = 'Jim Jones';
''')

      cust_id cust_name        cust_contact
0  1000000003   Fun4All           Jim Jones
1  1000000004   Fun4All  Denise L. Stephens

## Outer Joins
Most joins relate rows in one table with rows in another. But occasionally, you
want to include rows that have no related rows. For example, you might use joins
to accomplish the following tasks:
Count how many orders were placed by each customer, including customers
that have yet to place an order.
List all products with order quantities, including products not ordered by
anyone.
Calculate average sale sizes, taking into account customers that have not yet
placed an order.

### Caution: Syntax Differences
It is important to note that the syntax used to create an outer join can vary
slightly among different SQL implementations. The various forms of syntax
described in the following section cover most implementations, but refer to
your DBMS documentation to verify its syntax before proceeding

### Using Joins and Join Conditions
Before I wrap up our two-lesson discussion on joins, I think it is worthwhile to
summarize some key points regarding joins and their use:
1. Pay careful attention to the type of join being used. More often than not, you’ll want an inner join, but there are often valid uses for outer joins too.
2. Check your DBMS documentation for the exact join syntax it supports.
3. Make sure you use the correct join condition (regardless of the syntax being used), or you’ll return incorrect data.
4. Make sure you always provide a join condition, or you’ll end up with the Cartesian product.
5. You may include multiple tables in a join and even have different join types for each. Although this is legal and often useful, make sure you test each join separately before testing them together. This will make troubleshooting far simpler.

In [74]:
query('''
SELECT Customers.cust_id, Orders.order_num
FROM Customers
INNER JOIN Orders ON Customers.cust_id = Orders.cust_id;
''')

      cust_id  order_num
0  1000000001      20005
1  1000000001      20009
2  1000000003      20006
3  1000000004      20007
4  1000000005      20008

In [75]:
query('''
SELECT Customers.cust_id, Orders.order_num
FROM Customers
LEFT OUTER JOIN 
Orders ON Customers.cust_id = Orders.cust_id;
''')

      cust_id  order_num
0  1000000001    20005.0
1  1000000001    20009.0
2  1000000002        NaN
3  1000000003    20006.0
4  1000000004    20007.0
5  1000000005    20008.0

In [76]:
query('''
SELECT Customers.cust_id, Orders.order_num
FROM Customers
RIGHT OUTER JOIN Orders ON Customers.cust_id = Orders.cust_id;
''')

      cust_id  order_num
0  1000000001      20005
1  1000000001      20009
2  1000000003      20006
3  1000000004      20007
4  1000000005      20008

# Combining Queries
SQL queries are combined using the `UNION` operator. Using `UNION`, you can specify
multiple SELECT statements, and their results can be combined into a single result
set.

In [77]:
# You need a report on all your customers in Illinois, Indiana, and Michigan. 
# You also want to include all Fun4All locations, regardless of state. 

query('''
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_state IN ('IL','IN','MI');
''')

       cust_name cust_contact             cust_email
0   Village Toys   John Smith  sales@villagetoys.com
1        Fun4All    Jim Jones     jjones@fun4all.com
2  The Toy Store   Kim Howard                   None

In [78]:
query('''
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_name = 'Fun4All';
''')

  cust_name        cust_contact             cust_email
0   Fun4All           Jim Jones     jjones@fun4all.com
1   Fun4All  Denise L. Stephens  dstephens@fun4all.com

## UNION Rules
1. A UNION must be composed of two or more SELECT statements, each separated by the keyword UNION (so, if you’re combining four SELECT statements, you would use three UNION keywords).

2. Each query in a UNION must contain the same columns, expressions, oraggregate functions (and some DBMSs even require that columns be listed in the same order).
3. Column datatypes must be compatible. They need not be the same name or the exact same type, but they must be of a type that the DBMS can implicitly convert (for example, different numeric types or different date types).

### Note: UNION Column Names
If SELECT statements that are combined with a UNION have different column
names, what name is actually returned? For example, if one statement
contained SELECT prod_name and the next used SELECT productname, what
would be the name of the combined returned column?

The answer is that `the first name is used`, so in our example the combined
column would be named prod_name, even though the second SELECT used a
different name. This also means that you can use an alias on the first name to
set the returned column name as needed.

This behavior has another interesting side effect. Because the first set of
column names are used, only those names can be specified when sorting.Again, in our example, you could use ORDER BY prod_name to sort the
combined results, but ORDER BY productname would display an error message
because there is no column productname in the combined results.
## Including or Eliminating Duplicate Rows
`The UNION automatically removes any duplicate rows from the query result set (in
other words, it behaves just as multiple WHERE clause conditions in a single
SELECT would)`

 If you would, in fact, want all occurrences of all matches returned, you could use `UNION
ALL` instead of `UNION`.

### Tip: UNION Versus WHERE
At the beginning of this lesson, I said that UNION almost always accomplishes
the same thing as multiple WHERE conditions. UNION ALL is the form of UNION
that accomplishes what cannot be done with WHERE clauses. If you do, in fact,
want all occurrences of matches for every condition (including duplicates),
you must use `UNION ALL` and not `WHERE`.

**Joins Combine Columns**

![](./i/VisualDepictionOfJoin.png)


**Unions Combine Rows**
![](./i/VisualDepictionOfUnion.png)


## Sorting Combined Query Results
you may use only one ORDER BY clause, and it must occur
after the final SELECT statement. 


### Note: Other UNION Types
Some DBMSs support two additional types of UNION. EXCEPT (sometimes
called MINUS) can be used to retrieve only the rows that exist in the first table
but not in the second, and INTERSECT can be used to retrieve only the rows that
exist in both tables. In practice, however, these UNION types are rarely used
because the same results can be accomplished using joins.

### Tip: Working with Multiple Tables
For simplicity’s sake, the examples in this lesson have all used UNION to
combine multiple queries on the same table. In practice, UNION is really useful
when you need to combine data from multiple tables, even tables with
mismatched column names, in which case you can combine UNION with aliases
to retrieve a single set of results.

In [79]:
query('''
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_state IN ('IL','IN','MI')
UNION
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_name = 'Fun4All';
''')

# The preceding statements are made up of both of the previous SELECT statements
# separated by the UNION keyword. UNION instructs the DBMS to execute both
# SELECT statements and combine the output into a single query result set.

       cust_name        cust_contact             cust_email
0   Village Toys          John Smith  sales@villagetoys.com
1        Fun4All           Jim Jones     jjones@fun4all.com
2  The Toy Store          Kim Howard                   None
3        Fun4All  Denise L. Stephens  dstephens@fun4all.com

In [80]:
query('''
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_state IN ('IL','IN','MI')
UNION ALL
SELECT cust_name, cust_contact, cust_email
FROM Customers
WHERE cust_name = 'Fun4All'
ORDER BY cust_name, cust_contact;
''')

       cust_name        cust_contact             cust_email
0        Fun4All  Denise L. Stephens  dstephens@fun4all.com
1        Fun4All           Jim Jones     jjones@fun4all.com
2        Fun4All           Jim Jones     jjones@fun4all.com
3  The Toy Store          Kim Howard                   None
4   Village Toys          John Smith  sales@villagetoys.com

# Inserting Data

Insert can be used in several ways:
1. Inserting a single complete row
2. Inserting a single partial row
3. Inserting the results of a query

## Note: Can’t INSERT Same Record Twice
If you tried both versions of this example, you’ll have discovered that the
second generated an error because a customer with an ID of 1000000006
already existed.  primary
key values must be unique, and because cust_id is the primary key, the
DBMS won’t allow you to insert two rows with the same cust_id value. The
same is true for the next example. To try the other INSERT statements, you’d
need to delete the first row added (as will be shown in the next Lesson). Or
don’t, because the row has been inserted and you can continue the lessons
without deleting it.

### Tip: Always Use a Columns List
As a rule, never use INSERT without explicitly specifying the column list. This
will greatly increase the probability that your SQL will continue to function in
the event that table changes occur.

### Caution: Use VALUES Carefully
Regardless of the INSERT syntax being used, the correct number of VALUES
must be specified. If no column names are provided, a value must be present
for every table column. If column names are provided, a value must be
present for each listed column. If none is present, an error message will be
generated, and the row will not be inserted.

## Inserting Partial Rows
As I just explained, the recommended way to use INSERT is to explicitly specify
table column names. Using this syntax, you can also omit columns. This means
you provide values for only some columns, but not for others.

###  Caution: Omitting Columns
* You may omit columns from an INSERT operation if the table definition so allows. One of the following conditions must exist:
* The column is defined as allowing NULL values (no value at all).
* A default value is specified in the table definition. This means the default value will be used if no value is specified.
### Caution: Omitting Required Values
If you omit a value from a table that does not allow NULL values and does not
have a default, the DBMS will generate an error message, and the row will
not be inserted.

In [81]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="YourPAss",
#     database="teach_yourself_sql"
)



mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")
for x in mycursor:
  print(x)
# mycursor.execute("CREATE DATABASE mydatabase")
print("Done")

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('teach_yourself_sql',)
('world',)
Done

In [82]:
query("SHOW DATABASES")

             Database
0  information_schema
1               mysql
2  performance_schema
3              sakila
4                 sys
5  teach_yourself_sql
6               world

In [83]:
query("DESCRIBE teach_yourself_sql.customers;")

          Field          Type Null           Key Default Extra
0       cust_id   b'char(10)'   NO  [80, 82, 73]    None
1     cust_name   b'char(50)'   NO            []    None
2  cust_address   b'char(50)'  YES            []    None
3     cust_city   b'char(50)'  YES            []    None
4    cust_state    b'char(5)'  YES            []    None
5      cust_zip   b'char(10)'  YES            []    None
6  cust_country   b'char(50)'  YES            []    None
7  cust_contact   b'char(50)'  YES            []    None
8    cust_email  b'char(255)'  YES            []    None

In [84]:


# sql = "INSERT INTO Customers (cust_id, cust_name , cust_address ,cust_city , cust_state , cust_zip ,cust_country , cust_contact ,cust_email   ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)"
# val = [
#   ('1000000006', 'Toy Land', '123 Any Street','New York','NY', '11111', 'USA', '', '')
# ]

# mycursor.executemany(sql, val)

# mydb.commit()

# print(mycursor.rowcount, "was inserted.")

## Inserting Retrieved Data
INSERT is usually used to add a row to a table using specified values. There is
another form of INSERT that can be used to insert the result of a SELECT statement
into a table. This is known as INSERT SELECT, and, as its name suggests, it is made
up of an INSERT statement and a SELECT statement.


Suppose you want to merge a list of customers from another table into your
Customers table. Instead of reading one row at a time and inserting it with INSERT,
you can do the following:

In [85]:
# query('''
# INSERT INTO Customers(cust_id,
#                     cust_contact,
#                     cust_email,
#                     cust_name,
#                     cust_address,
#                     cust_city,
#                     cust_state,
#                     cust_zip,
#                     cust_country)
# SELECT               cust_id,
#                     cust_contact,
#                     cust_email,
#                     cust_name,
#                     cust_address,
#                     cust_city,
#                     cust_state,
#                     cust_zip,
#                     cust_country
# FROM CustNew;
# ''')

## Copying from One Table to Another

``` mysql
CREATE TABLE CustCopy AS SELECT * FROM Customers;
```

#  Updating and Deleting Data
UPDATE can be used in two ways:
1. To update specific rows in a table
2. To update all rows in a table

### Caution: Don’t Omit the WHERE Clause
Special care must be exercised when using UPDATE because it is all too easy
to mistakenly update every row in your table. Please read this entire section
on UPDATE before using this statement.
### Tip: UPDATE and Security
Use of the UPDATE statement might require special security privileges in
client/server DBMSs. Before you attempt to use UPDATE, make sure you have
adequate security privileges to do so.

The basic
format of an UPDATE statement is made up of three parts:

1. The table to be updated
2. The column names and their new values
3. The filter condition that determines which rows should be updated

``` sql

UPDATE Customers
SET cust_contact = 'Sam Roberts',
cust_email = 'sam@toyland.com'
WHERE cust_id = 1000000006;

```

#### Tip: Using Subqueries in an UPDATE Statement
Subqueries may be used in UPDATE statements, enabling you to update columns
with data retrieved with a SELECT statement.

### Tip: The FROM Keyword
Some SQL implementations support a FROM clause in the UPDATE statement that
can be used to update the rows in one table with data from another table.
Refer to your DBMS documentation to see if it supports this feature.

## Deleting Data
To delete (remove) data from a table, you use the DELETE statement. DELETE can beused in two ways:
1. To delete specific rows from a table
2. To delete all rows from a table

### Caution: Don’t Omit the WHERE Clause
Special care must be exercised when using DELETE because it is all too easy
to mistakenly delete every row from your table. Please read this entire
section on DELETE before using this statement.

```sql
DELETE FROM Customers
WHERE cust_id = 1000000006;
```

### Note: 
Table Contents, Not TablesThe DELETE statement deletes rows from tables, even all rows from tables.
**But DELETE never deletes the table itself**

### Tip: Faster Deletes
If you really do want to delete all rows from a table, don’t use DELETE.
Instead, use the TRUNCATE TABLE statement, which accomplishes the same
thing but does it much quicker (because data changes are not logged).

### Here are some important guidelines that many SQL programmers follow:
1. Never execute an UPDATE or a DELETE without a WHERE clause unless you really do intend to update and delete every row.
2. Make sure every table has a primary key , and use it as the WHERE clause whenever possible. (You may specify individual primary keys, multiple values, or value ranges.)
3. Before you use a WHERE clause with an UPDATE or a DELETE, first test it with a SELECT to make sure it is filtering the right records; it is far too easy to write incorrect WHERE clauses.
4. Use database-enforced referential integrity  so that the DBMS will not allow the deletion of rows that have data in other tables related to them.
5. Some DBMSs allow database administrators to impose restrictions that prevent the execution of UPDATE or DELETE without a WHERE clause. If your DBMS supports this feature, consider using it.

# Creating and Manipulating Tables
## There are generally two ways to create database tables:
1. Most DBMSs come with an administration tool that you can use to create and manage database tables interactively.
2. Tables may also be manipulated directly with SQL statements.

To create a table using CREATE TABLE, you must specify the following information:
1. The name of the new table specified after the keywords CREATE TABLE.
2. The name and definition of the table columns separated by commas.
3. Some DBMSs require that you also specify the table location

```sql
CREATE TABLE Products
(
    prod_id CHAR(10) NOT NULL,
    vend_id CHAR(10) NOT NULL,
    prod_name CHAR(254) NOT NULL,
    prod_price DECIMAL(8,2) NOT NULL,
    prod_desc VARCHAR(1000) NULL
);
```

### Tip: Statement Formatting
As you will recall, white space is ignored in SQL statements. Statements can
be typed on one long line or broken up over many lines. It makes no
difference at all. This enables you to format your SQL as best suits you. The
preceding CREATE TABLE statement is a good example of SQL statement
formatting: the code is specified over multiple lines, with the column
definitions indented for easier reading and editing. Formatting your SQL in
this way is entirely optional but highly recommended.

### Tip: Replacing Existing Tables
When you create a new table, the table name specified must not exist;
otherwise, you’ll generate an error. To prevent accidental overwriting, SQL
requires that you first manually remove a table (see later sections for details)
and then re-create it, rather than just overwriting it.

## Working with NULL Values
A column that allows NULL values also allows rows to be
inserted with no value at all in that column. A column that does not allow NULL
values does not accept rows with no value; in other words, that column will
always be required when rows are inserted or updated.

```sql
CREATE TABLE Orders
(
    order_num INTEGER NOT NULL,
    order_date DATETIME NOT NULL,
    cust_id CHAR(10) NOT NULL
);


CREATE TABLE Vendors
(
    vend_id CHAR(10) NOT NULL,
    vend_name CHAR(50) NOT NULL,
    vend_address CHAR(50) ,vend_city CHAR(50) ,
    vend_state CHAR(5) ,
    vend_zip CHAR(10) ,
    vend_country CHAR(50)
);
```

### Caution: Understanding NULL
Don’t confuse NULL values with empty strings. A NULL value is the lack of a
value; it is not an empty string. If you were to specify '' (two single quotes
with nothing in between them), that would be allowed in a NOT NULL column.An empty string is a valid value; it is not no value. NULL values are specified
with the keyword NULL, not with an empty string.

## Specifying Default Values

```sql
CREATE TABLE OrderItems
(
    order_num INTEGER NOT NULL,
    order_item INTEGER NOT NULL,
    prod_id CHAR(10) NOT NULL,
    quantity INTEGER NOT NULL DEFAULT 1,
    item_price DECIMAL(8,2) NOT NULL
);
```

## Updating Tables
To update table definitions, you use the ALTER TABLE statement. Although all
DBMSs support ALTER TABLE, what they allow you to alter varies dramatically
from one to another. Here are some points to consider when using ALTER TABLE:
1. Ideally, tables should never be altered after they contain data. You should spend sufficient time anticipating future needs during the table design process so that extensive changes are not required later on.
2. All DBMSs allow you to add columns to existing tables, although some restrict the datatypes that may be added (as well as NULL and DEFAULT usage).
3. Many DBMSs do not allow you to remove or change columns in a table.Most DBMSs allow you to rename columns.
4. Many DBMSs restrict the kinds of changes you can make on columns that are populated and enforce fewer restrictions on unpopulated columns.

`To change a table using ALTER TABLE, you must specify the following information:`
1. The name of the table to be altered after the keywords ALTER TABLE. (The table must exist; otherwise, an error will be generated.)
2. The list of changes to be made.

```sql
ALTER TABLE Vendors
ADD vend_phone CHAR(20);

ALTER TABLE Vendors
DROP COLUMN vend_phone;
```

### Complex table structure changes usually require a manual move process
involving these steps:
1. Create a new table with the new column layout.
2. Use the INSERT SELECT statement to copy the data from the old table to the new table. Use conversion functions and calculated fields, if needed.
3. Verify that the new table contains the desired data.
4. Rename the old table (or delete it, if you are really brave).
5. Rename the new table with the name previously used by the old table.
6. Re-create any triggers, stored procedures, indexes, and foreign keys as needed.

### Note: ALTER TABLE and SQLite
SQLite limits the operations that may be performed using ALTER TABLE. One
of the most important limitations is that it does not support the use of ALTER
TABLE to define primary and foreign keys; these must be specified at initial
CREATE TABLE time.
### Caution: Use ALTER TABLE Carefully
Use ALTER TABLE with extreme caution, and be sure you have a complete set
of backups (both schema and data) before proceeding. Database table
changes cannot be undone, and if you add columns you don’t need, you might
not be able to remove them. Similarly, if you drop a column that you do need,
you might lose all the data in that column.

## Deleting Tables

```sql
DROP TABLE CustCopy;
```

# Using Views
## Note: Views in SQLite
SQLite supports only read-only views, so views may be created and read, but
their contents cannot be updated.
## Why Use Views
You’ve already seen one use for views. Here are some other common uses:
1. To reuse SQL statements.
2. To simplify complex SQL operations. After the query is written, it can be reused easily, without having to know the details of the underlying query itself.
3. To expose parts of a table instead of complete tables.
4. To secure data. Users can be given access to specific subsets of tablesinstead of to entire tables.
5. To change data formatting and representation. Views can return data formatted and presented differently from their underlying tables.

### Caution: Performance Issues
Because views contain no data, any retrieval needed to execute a query must
be processed every time the view is used. If you create complex views with
multiple joins and filters, or if you nest views, you may find that performance
is dramatically degraded. Be sure you test execution before deploying
applications that use views extensively.

## View Rules and Restrictions
1. Like tables, views must be uniquely named. (They cannot be named with the name of any other table or view.)
2. There is no limit to the number of views that can be created.To create views, you must have security access. This level of access is usually granted by the database administrator.
3. Views can be nested; that is, a view may be built using a query that retrieves data from another view. The exact number of nested levels allowed varies from DBMS to DBMS. (Nesting views may seriously degrade query performance, so test this thoroughly before using it in production environments.)
4. Many DBMSs prohibit the use of the `ORDER BY` clause in view queries.
5. Some DBMSs require that every column returned be named; this will require the use of aliases if columns are calculated fields. 
6. Views cannot be indexed, nor can they have triggers or default values associated with them.
7. Some DBMSs, like SQLite, treat views as read-only queries, meaning you can retrieve data from views but not write data back to the underlying tables. Refer to your DBMS documentation for details.
8. Some DBMSs allow you to create views that do not allow rows to be inserted or updated if that insertion or update will cause that row to no longer be part of the view. For example, if you have a view that retrieves only customers with email addresses, updating a customer to remove his email address would make that customer fall out of the view. This is the default behavior and is allowed, but depending on your DBMS, you might be able to prevent this from occurring.

## Creating Views
Views are created using the CREATE VIEW statement. Like CREATE TABLE, CREATE
VIEW can only be used to create a view that does not exist.
### Note: Renaming Views
To remove a view, you use the DROP statement. The syntax is simply DROP
VIEW viewname;.
To overwrite (or update) a view, you must first DROP it and then re-create it.

```sql
CREATE VIEW ProductCustomers AS
SELECT cust_name, cust_contact, prod_id
FROM Customers, Orders, OrderItems
WHERE Customers.cust_id = Orders.cust_id AND OrderItems.order_num = Orders.order_num;
```
### Tip: Creating Reusable Views
It is a good idea to create views that are not tied to specific data. For
example, the view created above returns customers for all products, not just
product RGAN01 (for which the view was first created). Expanding the scope
of the view enables it to be reused, making it even more useful. It also
eliminates the need for you to create and maintain multiple similar views.


## Using Views to Reformat Retrieved Data

```sql
SELECT RTRIM(vend_name) + ' (' + RTRIM(vend_country) + ')'
AS vend_title
FROM Vendors
ORDER BY vend_name;



CREATE VIEW VendorLocations AS
SELECT RTRIM(vend_name) + ' (' + RTRIM(vend_country) + ')'
AS vend_title
FROM Vendors;



CREATE VIEW VendorLocations AS
SELECT RTRIM(vend_name) || ' (' || RTRIM(vend_country) || ')'
AS vend_title
FROM Vendors;
```

### Note: SELECT Restrictions All Apply
Earlier in this lesson I stated that the syntax used to create views is rather
consistent between DBMSs. So why multiple versions of statements? A view
simply wraps a SELECT statement, and the syntax of that SELECT must adhere to
all the rules and restrictions of the DBMS being used.

## Using Views to Filter Unwanted Data
```sql
CREATE VIEW CustomerEMailList ASSELECT cust_id, cust_name, cust_email
FROM Customers
WHERE cust_email IS NOT NULL;
```

### Note: WHERE Clauses and WHERE Clauses
If a WHERE clause is used when retrieving data from the view, the two sets of
clauses (the one in the view and the one passed to it) will be combined
automatically.

## Using Views with Calculated Fields
```sql
SELECT prod_id,
quantity,
item_price,
quantity*item_price AS expanded_price
FROM OrderItems
WHERE order_num = 20008;


CREATE VIEW OrderItemsExpanded AS
SELECT order_num,
prod_id,
quantity,
item_price,
quantity*item_price AS expanded_price
FROM OrderItems


SELECT *
FROM OrderItemsExpanded
WHERE order_num = 20008;
```

# Working with Stored Procedures

In [86]:
import datetime
now = datetime.datetime.now()
print ("Current date and time : ")
print (now.strftime("%Y-%m-%d %H:%M:%S"))
now

Current date and time :
2021-07-24 20:14:53

datetime.datetime(2021, 7, 24, 20, 14, 53, 261388)

In [88]:
print("Page 236 / 533")

Page 236 / 533